#ifndef _CAMERA_H
#define _CAMERA_H

#include "types.h"
#include "area.h"
#include "engine/geo_layout.h"

#define ABS(x) ((x) > 0.f ? (x) : -(x))
#define ABS2(x) ((x) >= 0.f ? (x) : -(x))

#define AREA_BBH                0x0041
#define AREA_CCM_OUTSIDE        0x0051
#define AREA_CCM_SLIDE          0x0052
#define AREA_CASTLE_LOBBY       0x0061
#define AREA_CASTLE_TIPPY       0x0062
#define AREA_CASTLE_BASTEMENT   0x0063
#define AREA_HMC                0x0071
#define AREA_SSL_OUTSIDE        0x0081
#define AREA_SSL_PYRAMID        0x0082
#define AREA_SSL_EYEROK         0x0083
#define AREA_BOB                0x0091
#define AREA_SL_OUTSIDE         0x00A1
#define AREA_SL_IGLOO           0x00A2
#define AREA_WDW_MAIN           0x00B1
#define AREA_WDW_TOWN           0x00B2
#define AREA_JRB_MAIN           0x00C1
#define AREA_JRB_SHIP           0x00C2
#define AREA_THI_HUGE           0x00D1
#define AREA_THI_TINY           0x00D2
#define AREA_THI_WIGGLER        0x00D3
#define AREA_TTC                0x00E1
#define AREA_RR                 0x00F1
#define AREA_OUTSIDE_CASTLE     0x0101
#define AREA_BITDW              0x0111
#define AREA_VCUTM              0x0121
#define AREA_BITFS              0x0131
#define AREA_SA                 0x0141
#define AREA_BITS               0x0151
#define AREA_LLL_OUTSIDE        0x0161
#define AREA_LLL_VOLCANO        0x0162
#define AREA_DDD_WHIRLPOOL      0x0171
#define AREA_DDD_SUB            0x0172
#define AREA_WF                 0x0181

#define CAM_FLAG_2_COLLIDING_WITH_WALL    0x0020
#define CAM_FLAG_2_SLEEPING               0x0040
#define CAM_FLAG_2_UNUSED_7               0x0080
#define CAM_FLAG_2_UNUSED_8               0x0100
#define CAM_FLAG_2_UNKNOWN_9              0x0200
#define CAM_FLAG_2_UNKNOWN_10             0x0400
#define CAM_FLAG_2_UNKNOWN_11             0x0800
#define CAM_FLAG_2_BLOCK_LEVEL_SPECIFIC_UPDATES             0x1000
#define CAM_FLAG_2_UNUSED_13              0x2000
#define CAM_FLAG_2_UNUSED_CUTSCENE_ACTIVE 0x4000
#define CAM_FLAG_2_BEHIND_MARIO_POST_DOOR 0x8000

#define SHAKE_ATTACK         1
#define SHAKE_GROUND_POUND   2
#define SHAKE_SMALL_DAMAGE   3
#define SHAKE_MED_DAMAGE     4
#define SHAKE_LARGE_DAMAGE   5
#define SHAKE_HIT_FROM_BELOW 8
#define SHAKE_FALL_DAMAGE    9
#define SHAKE_SHOCK          10

#define SHAKE_2_UNKNOWN_1         1
#define SHAKE_2_UNKNOWN_2         2
#define SHAKE_2_UNKNOWN_3         3
#define SHAKE_2_UNKNOWN_5         5
#define SHAKE_2_UNKNOWN_6         6
#define SHAKE_2_UNKNOWN_7         7
#define SHAKE_2_UNKNOWN_8         8
#define SHAKE_2_JRB_SHIP_DRAIN    9
#define SHAKE_2_FALLING_BITS_PLAT 10

#define CUTSCENE_DOOR_0             130
#define CUTSCENE_DOOR_1             131
#define CUTSCENE_ENTER_CANNON       133
#define CUTSCENE_ENTER_PAINTING     134
#define CUTSCENE_DEATH_EXIT         135
#define CUTSCENE_DOOR_WARP          139
#define CUTSCENE_DOOR_A             140
#define CUTSCENE_DOOR_B             141
#define CUTSCENE_INTRO_PEACH        142
#define CUTSCENE_STAR_DANCE_1_1     143
#define CUTSCENE_ENTER_BOWSER_ARENA 144
#define CUTSCENE_0F_TODO            145
#define CUTSCENE_11_TODO            147
#define CUTSCENE_SLIDING_DOORS_OPEN 149
#define CUTSCENE_PREPARE_CANNON     150
#define CUTSCENE_UNLOCK_KEY_DOOR    151
#define CUTSCENE_STANDING_DEATH     152
#define CUTSCENE_DEATH_2            153
#define CUTSCENE_DEATH_ON_BACK      154
#define CUTSCENE_QUICKSAND_DEATH    155
#define CUTSCENE_SUFFOCATION_DEATH  156
#define CUTSCENE_EXIT_BOWSER_SUCC   157
#define CUTSCENE_1C_TODO            158
#define CUTSCENE_WATER_DEATH        159 //Not in cutscene switch
#define CUTSCENE_EXIT_PAINTING_SUCC 160
#define CUTSCENE_CAP_SWITCH_PRESS   161
#define CUTSCENE_DIALOG_1           162
#define CUTSCENE_DIALOG_2           163
#define CUTSCENE_ENTER_PYRAMID_TOP  164
#define CUTSCENE_STAR_DANCE_2       165
#define CUTSCENE_STAR_DANCE_3       166
#define CUTSCENE_KEY_DANCE          167
#define CUTSCENE_26_TODO            168
#define CUTSCENE_EXIT_BBH_SUCC      169
#define CUTSCENE_NONPAINTING_DEATH  170
#define CUTSCENE_READ_MESSAGE       171
#define CUTSCENE_PEACH_END          172
#define CUTSCENE_STAR_SPAWN         173
#define CUTSCENE_GRAND_STAR         174
#define CUTSCENE_STAR_DANCE_1_2     175
#define CUTSCENE_SPECIAL_STAR_SPAWN 176
#define CUTSCENE_END_WAVING         177
#define CUTSCENE_CREDITS            178
#define CUTSCENE_EXIT_WATERFALL     179
#define CUTSCENE_EXIT_FALL_WMOTR    180
#define CUTSCENE_ENTER_POOL         181

// sorted

struct CameraPlayerStatus
{
    /*0x00*/ u32 action;
    /*0x04*/ Vec3f pos;
    /*0x10*/ Vec3s faceAngle;
    /*0x16*/ Vec3s unk16;
    /*0x1C*/ s16 unk1C[2]; //only unk1C[1] seems used, represents an effective cutscene
    /*0x20*/ struct Object *usedObj;
};

struct TransitionCamera
{
    /*0x00*/ s16 pitch1;
    /*0x02*/ s16 yaw1;
    /*0x04*/ f32 dist1;
    /*0x08*/ s16 pitch2;
    /*0x0A*/ s16 yaw2;
    /*0x0C*/ f32 dist2;
    /*0x10*/ s32 timer;
    /*0x14*/ Vec3f marioPos;
    /*0x20*/ u8 pad; // for the structs to align, there has to be an extra unused variable here. type is unknown.
};

struct Struct8033B2B8
{
    /*0x00*/ s8 unk0;
    union {
        /*0x08*/ Vec3s unk8;
        /*0x08*/ long long int force_structure_alignment;
    } myUnion;
}; // size = 0x10

// unsorted

struct Struct80287404
{
    u8 filler0[0x18];
    s32 unk18;
    Vec3f unk1C;
    Vec3f unk28;
    u8 filler34[0x3A-0x34];
    s16 unk3A;
};

// Camera command procedures are marked as returning s32, but none of them
// actually return a value. This causes undefined behavior, which we'd rather
// avoid on modern GCC. Hence, typedef. Interestingly, the void vs s32
// difference doesn't affect -g, only -O2.
#ifdef __GNUC__
typedef void CmdRet;
#else
typedef s32 CmdRet;
#endif

typedef CmdRet (*CameraCommandProc)(struct LevelCamera *a);

struct TableCamera
{
    s8 area;
    CameraCommandProc unk4;
    s16 unk8;
    s16 unkA;
    s16 unkC;
    s16 unkE;
    s16 unk10;
    s16 unk12;
    s16 unk14;
};

struct CutsceneTableEntry
{
    CameraCommandProc unk0;
    s16 unk4;
};

struct Struct8033B230
{
    /*0x00*/ u8 unk0;
    /*0x04*/ f32 fieldOfView;
    /*0x08*/ f32 unk8;
    /*0x0C*/ u32 unkC;
    /*0x10*/ f32 unk10;
    /*0x14*/ s16 unk14;
    /*0x16*/ s16 unk16;
    /*0x18*/ s16 unk18;
};

struct CinematicCameraTable
{
    /*0x00*/ s8 unk0;
    /*0x01*/ u8 unk1;
    /*0x02*/ Vec3s unk2;
}; // size = 0x08

struct PlayerGeometry
{
    /*0x00*/ struct Surface *currFloor;
    /*0x04*/ f32 currFloorHeight;
    /*0x08*/ s16 currFloorType;
    /*0x0C*/ struct Surface *currCeil;
    /*0x10*/ s16 currCeilType;
    /*0x14*/ f32 currCeilHeight;
    /*0x18*/ struct Surface *prevFloor;
    /*0x1C*/ f32 prevFloorHeight;
    /*0x20*/ s16 prevFloorType;
    /*0x24*/ struct Surface *prevCeil;
    /*0x28*/ f32 prevCeilHeight;
    /*0x2C*/ s16 prevCeilType;
    /*0x30*/ f32 waterHeight;
};

struct Struct8033B418_sub
{
    Vec3f unk0;
    Vec3f unkC;
    f32 unk18;
    s16 unk1C;
    s16 unk1E;
};

struct Struct8033B418
{
    s16 unk0;
    s16 unk2;
    s16 unk4;
    s16 unk6;
    struct Struct8033B418_sub unk8;
    struct Struct8033B418_sub unk28;
};

struct ParallelTrackingTable
{
    s16 unk0;
    Vec3f unk4;
    f32 unk10;
    f32 unk14;
};

struct Struct8033B4B8
{
    /*0x00*/ Vec3f pos;
    /*0x0C*/ Vec3f focus;
    /*0x18*/ f32 unk18;
    /*0x1C*/ f32 unk1C;
};

struct Struct8033B6F0
{
    s32 unk0;
    Vec3f unk4;
    Vec3f unk10;
    Vec3s unk1C;
    s16 unk22;
};

struct CameraState
{
    /*0x00*/ Vec3f camFocAndPosCurrAndGoal[4];
    /*0x30*/ u8 filler30[12]; // extra unused Vec3f?
    /*0x3C*/ u8 modeActive;
    /*0x3D*/ u8 modeDefault;
    /*0x3E*/ u8 filler3E[10];
    /*0x48*/ float focusDistance; //unused
    /*0x4C*/ s16 pitch; //unused
    /*0x4E*/ s16 yaw;   //unused
    /*0x50*/ u8 filler50[2];
    /*0x52*/ Vec3s shakeMagnitude;
    /*0x58*/ s16 shakePitchOffset;
    /*0x5A*/ s16 shakePitchIncrement;
    /*0x5C*/ s16 shakePitchMagIncrement;
    /*0x5E*/ u8 filler5E[2];
    /*0x60*/ Vec3f unk60;   //unused
    /*0x6C*/ Vec3s unk6C;   //unused
    /*0x72*/ u8 filler72[8];
    /*0x7A*/ s16 roll;
    /*0x7C*/ s16 trueYaw;
    /*0x7E*/ s16 storedYaw;
    /*0x80*/ Vec3f focus;
    /*0x8C*/ Vec3f pos;
    /*0x98*/ s16 shakeRollOffset;
    /*0x9A*/ s16 shakeRollIncrement;
    /*0x9C*/ s16 shakeRollMagIncrement;
    /*0x9E*/ s16 shakeYawOffset;
    /*0xA0*/ s16 shakeYawIncrement;
    /*0xA2*/ s16 shakeYawMagIncrement;
    /*0xA4*/ float unkA4;
    /*0xA8*/ float unkA8;
    /*0xAC*/ float unkAC;
    /*0xB0*/ float unkB0;
    /*0xB4*/ s16 cameraKeyCutsceneRollOffset;
    /*0xB8*/ u32 lastFrameAction;
    /*0xBC*/ s16 unkBC;
};

// bss order hack to not affect BSS order. if possible, remove me, but it will be hard to match otherwise
#ifndef INCLUDED_FROM_CAMERA_C
// BSS
extern struct CameraPlayerStatus gPlayerStatusForCamera[2];
extern s16 gCameraModeFlags;
extern s16 sCameraSideCFlags;
extern s16 gCameraFlags1;
extern u16 gCButtonsPressed;
extern struct CameraState gCameraStatus;
extern s16 gCameraMovementFlags;
extern s32 gCutsceneActive;
extern struct LevelCamera *gCurrLevelCamera;
#endif

extern struct Object *gCutsceneFocus;
extern struct Object *gSecondCameraFocus;

// TODO: sort all of this extremely messy shit out after the split
// TODO: bring in some externs from camera.c

extern Vec3f sFixedPresetBasePosition;
extern u8 D_8032D0B8[];

extern void set_camera_shake(s16);
extern void set_camera_shake_2(s16);
extern void func_8027F440(s16, f32, f32, f32);
extern void operate_c_up_looking(struct LevelCamera *); // static (ASM)
