COURSE_ACTS(COURSE_BOB, _("　１　炸弹王国"),
       _("　山顶上的炸弹王")         , _("　喏库诺库的田径锦标赛")     , _("　空中岛屿"),
       _("　炸弹王国的８枚红色硬币") , _("　长翅膀的马力欧")           , _("　汪汪看守的铁门"))

COURSE_ACTS(COURSE_WF, _("　２　嘭嘭要塞"),
       _("　疯狂的嘭嘭王")           , _("　要塞之巅")                 , _("　射向蓝天"),
       _("　浮岛上的红色硬币")       , _("　空降到摇篮岛")             , _("　破壁摘星"))

COURSE_ACTS(COURSE_JRB, _("　３　海盗湾"),
       _("　沉船里的宝藏")           , _("　出来玩吧海鳗")             , _("　海底岩洞的财宝"),
       _("　浮船上的红色硬币")       , _("　发射到石柱平台")           , _("　穿越急流"))

COURSE_ACTS(COURSE_CCM, _("　４　酷冰冰雪山"),
       _("　企鹅的滑梯")             , _("　该回家了企鹅宝宝")         , _("　大企鹅的滑雪比赛"),
       _("　冰雪中的８枚红色硬币")   , _("　帮助雪人寻找脑袋")         , _("　要用踢墙跳了"))

COURSE_ACTS(COURSE_BBH, _("　５　大嘘嘘鬼的城堡"),
       _("　马力欧猎鬼记")           , _("　嘘嘘鬼的旋转木马")         , _("　书房密室"),
       _("　寻找８枚红色硬币")       , _("　大嘘嘘鬼的阳台")           , _("　密室里的大眼睛"))

COURSE_ACTS(COURSE_HMC, _("　６　迷失洞窟"),
       _("　洞穴里的海怪")           , _("　移动平台的红色硬币")       , _("　金属马力欧"),
       _("　通过毒气洞窟")           , _("　迷宫里的紧急出口")         , _("　小心落下的巨石"))

COURSE_ACTS(COURSE_LLL, _("　７　岩浆地狱"),
       _("　融化斗斗帮主")           , _("　打败斗斗帮")               , _("　１５块拼图中的８枚红色硬币"),
       _("　灼热的滚木陷阱")         , _("　跳进火山")                 , _("　火山里的电梯之旅"))

COURSE_ACTS(COURSE_SSL, _("　８　酷热沙漠"),
       _("　还给我星星　　秃鹫")     , _("　金字塔顶的闪光")           , _("　法老的珍宝"),
       _("　立于四柱之颠")           , _("　为了８枚红色硬币自由飞翔") , _("　金字塔之谜"))

COURSE_ACTS(COURSE_DDD, _("　９　恐怖船坞"),
       _("　酷霸王的潜水艇")         , _("　湍流中的宝箱")             , _("　天才的杂技演员"),
       _("　急流勇进")               , _("　鳐鱼的奖励")               , _("　帽子收藏家"))

COURSE_ACTS(COURSE_SL, _("１０　雪人王国"),
       _("　大头雪人")               , _("　寒冷的斗斗")               , _("　冰雕迷宫"),
       _("　冰冻池塘圆舞曲")         , _("　雪地滑板与红色硬币")       , _("　爱斯基摩人的小屋"))

COURSE_ACTS(COURSE_WDW, _("１１　水下遗迹"),
       _("　箭头跳板")               , _("　水城之巅")                 , _("　天空和水下的秘密"),
       _("　快速电梯——抓紧时间")     , _("　小镇里的８枚红色硬币")     , _("　快速穿过小镇"))

COURSE_ACTS(COURSE_TTM, _("１２　高高山脉"),
       _("　攀登高高的山脉")         , _("　神秘的小猴呦奇的笼子")     , _("　蘑菇上的红色硬币"),
       _("　山间滑道")               , _("　惊险水帘洞")               , _("　孤独的蘑菇"))

COURSE_ACTS(COURSE_THI, _("１３　小人国大人国"),
       _("　食人花")                 , _("　大人国之巅")               , _("　喏库喏库又回来了"),
       _("　小人国的五个秘密")       , _("　花之子的红色硬币")         , _("　蠕动的花之子"))

COURSE_ACTS(COURSE_TTC, _("１４　摇摆古钟"),
       _("　跳进笼子")               , _("　小洞和钟摆")               , _("　跳上指针"),
       _("　时钟的顶楼")             , _("　恰好踏在移动的木块上")     , _("　正点的红色硬币"))

COURSE_ACTS(COURSE_RR, _("１５　彩虹之旅"),
       _("　穿梭在彩虹之间的飞行船") , _("　云中城堡")                 , _("　迷宫中收集硬币"),
       _("　风中摇荡")               , _("　狡猾的三角")               , _("　在彩虹之上的某处"))

SECRET_STAR(COURSE_BITDW,    _("　　　黑暗世界的酷霸王"))
SECRET_STAR(COURSE_BITFS,    _("　　　火海中的酷霸王"))
SECRET_STAR(COURSE_BITS,     _("　　　天空之城的酷霸王"))
SECRET_STAR(COURSE_PSS,      _("　　　公主的秘密滑梯"))
SECRET_STAR(COURSE_COTMC,    _("　　　金属帽的瀑布石洞"))
SECRET_STAR(COURSE_TOTWC,    _("　　　飞行帽之塔"))
SECRET_STAR(COURSE_VCUTM,    _("　　　护城河里的隐身帽"))
SECRET_STAR(COURSE_WMOTR,    _("　　　飞越彩虹"))
SECRET_STAR(COURSE_SA,       _("　　　秘密水族馆"))
SECRET_STAR(COURSE_CAKE_END, _(""))

CASTLE_SECRET_STARS(_("　　　城堡里的隐藏星"))

EXTRA_TEXT(0, _("　城堡中的隐藏星"))
EXTRA_TEXT(1, _(""))
EXTRA_TEXT(2, _(""))
EXTRA_TEXT(3, _(""))
EXTRA_TEXT(4, _(""))
EXTRA_TEXT(5, _(""))
EXTRA_TEXT(6, _(""))
