// Parameters: dialog enum ID, (unused), lines per box, left offset, width

DEFINE_DIALOG(DIALOG_000, 1, 6, 30, 200, _("\
哇！你闯入炸弹\n\
王国的战场啦。\n\
你可以在这个壁\n\
画世界里找到酷\n\
霸王偷走的\n\
力量之星。\n\
　\n\
你可以先去问问\n\
炸弹兵（按[B]键\n\
开始对话），从\n\
他和他的伙伴那\n\
里可以得到帮\n\
助。\n\
　\n\
如果需要察看路\n\
标，面对它，按\n\
[B]键。按[A]键或[B]\n\
键来翻页。你还\n\
可以站在其他人\n\
面前，按[B]键来\n\
和他们对话。"))

DEFINE_DIALOG(DIALOG_001, 1, 4, 95, 200, _("\
当心！如果你在\n\
这里瞎逛，随时\n\
有可能被水珠炸\n\
弹炸伤！那些敌\n\
对的炸弹兵非常\n\
好战，他们总是\n\
想方设法来攻击\n\
你。\n\
　\n\
自从炸弹王得到\n\
了力量之星，这\n\
片草原就变得战\n\
火纷飞。你能帮\n\
我们找回力量之\n\
星吗？穿过这座\n\
桥，沿着左上的\n\
小路可以找到炸\n\
弹王。如果你夺\n\
回力量之星，记\n\
得一定要回来看\n\
看我啊。"))

DEFINE_DIALOG(DIALOG_002, 1, 4, 95, 200, _("\
嘿！你听着，前\n\
面很危险，一定\n\
要小心噢！听好\n\
我的忠告！\n\
　\n\
穿过前面的两座\n\
桥以后，一定要\n\
小心天上坠落的\n\
水珠炸弹。\n\
　\n\
在山顶，你会找\n\
到炸弹王，他可\n\
是非常强大噢，\n\
千万不要让他\n\
抓到你啊！\n\
　\n\
我们是站在你一\n\
边的炸弹兵，你\n\
随时都可以来找\n\
我们帮忙。"))

DEFINE_DIALOG(DIALOG_003, 1, 5, 95, 200, _("\
谢谢，马力欧！\n\
现在的炸弹王只\n\
是一个哑弹了，\n\
哈哈！但是，真\n\
正的战斗才刚刚\n\
开始。\n\
　\n\
其余的力量之星\n\
被其他敌人拿走\n\
了。只有夺回更\n\
多的力量之星，\n\
你才可以打开通\n\
往其它新世界的\n\
大门。我的伙伴\n\
们正在等着你，\n\
别忘了去找他们\n\
啊！他们会为你\n\
准备好大炮的。"))

DEFINE_DIALOG(DIALOG_004, 1, 3, 95, 200, _("\
我们是爱好和平\n\
的炸弹兵，所以\n\
我们不用大炮。\n\
　\n\
我们不会介意你\n\
从大炮中发射出\n\
去，我们会为你\n\
准备好这一关卡\n\
的所有大炮。\n\
一路顺风！"))

DEFINE_DIALOG(DIALOG_005, 1, 4, 30, 200, _("\
嘿，马力欧。真\n\
的是你打败了炸\n\
弹王吗？厉害！\n\
你一定很强大而\n\
且行动迅速吧？\n\
不过，你到底有\n\
多快呢？可以追\n\
上我吗？我可是\n\
大名鼎鼎的喏库\n\
喏库！哈…哈！\n\
你赢不了我的！\n\
你可以来试试，\n\
我们来打个赌，\n\
你和我来一次赛\n\
跑比赛，终点就\n\
是你打败炸弹王\n\
的那个山顶。你\n\
看怎么样？当我\n\
说“开始”，就\n\
开始比赛！\n\
　\n\
好了，预备…\n\
　\n\
　　开始！　　不"))

DEFINE_DIALOG(DIALOG_006, 1, 3, 30, 200, _("\
嘿！！！别当我\n\
是傻瓜。下次记\n\
得跑完全程！等\n\
你真的想比赛的\n\
时候再来找我！"))

DEFINE_DIALOG(DIALOG_007, 1, 5, 30, 200, _("\
哈呼…哈呼…\n\
哇！你…真是…\n\
好快…啊！真是\n\
个疯子！这个给\n\
你吧，你赢了！\n\
我愿赌服输。"))

DEFINE_DIALOG(DIALOG_008, 1, 4, 30, 200, _("\
千万当心那个满\n\
嘴铁牙带着锁链\n\
的家伙！它很危\n\
险！你靠近它，\n\
按[C]▲键仔细看。\n\
吓坏了，是吗？\n\
再看看木桩上的\n\
那枚红色硬币！\n\
　\n\
当你收集了八枚\n\
这样的硬币后，\n\
桥那边的草地上\n\
就会出现一颗\n\
力量之星。"))

DEFINE_DIALOG(DIALOG_009, 1, 5, 30, 200, _("\
哇！好久不见！\n\
你跑得更快了？\n\
还是你更加狡猾\n\
了？还是那些星\n\
星给了你力量？\n\
上次输给你我真\n\
不甘心。现在是\n\
我的主场，我们\n\
再来比比如何？\n\
终点就是风之峡\n\
谷。预备？\n\
　\n\
　　开始！　　不"))

DEFINE_DIALOG(DIALOG_010, 1, 4, 30, 200, _("\
你踩了飞行帽的\n\
开关。戴上飞行\n\
帽，你就可以在\n\
空中飞翔了。\n\
　\n\
从现在开始，所\n\
有你找到的红色\n\
砖块里都会跳出\n\
飞行帽。\n\
　\n\
要保存游戏吗？\n\
　\n\
　　是　　　　　　　　否"))

DEFINE_DIALOG(DIALOG_011, 1, 4, 30, 200, _("\
你踩了金属帽的\n\
开关。金属帽会\n\
让马力欧无敌。\n\
　\n\
从现在开始，所\n\
有你找到的绿色\n\
砖块里都会跳出\n\
金属帽。\n\
　\n\
要保存游戏吗？\n\
　\n\
　　是　　　　　　　　否"))

DEFINE_DIALOG(DIALOG_012, 1, 4, 30, 200, _("\
你踩了隐身帽的\n\
开关。隐身帽会\n\
让马力欧透明，\n\
敌人将看不见马\n\
力欧。\n\
　\n\
从现在开始，所\n\
有你找到的蓝色\n\
砖块里都会跳出\n\
隐身帽。\n\
　\n\
要保存游戏吗？\n\
　\n\
　　是　　　　　　　　否"))

DEFINE_DIALOG(DIALOG_013, 1, 5, 30, 200, _("\
你已经夺回了\n\
１００枚硬币！\n\
马力欧从城堡中\n\
得到了更多的力\n\
量。\n\
　\n\
要保存游戏吗？\n\
　\n\
　　是　　　　　　　　否"))

DEFINE_DIALOG(DIALOG_014, 1, 4, 30, 200, _("\
哇！又一颗力量\n\
之星！马力欧从\n\
城堡中得到了更\n\
多的力量。\n\
　\n\
要保存游戏吗？\n\
　\n\
　　没错！　　　不"))

DEFINE_DIALOG(DIALOG_015, 1, 4, 30, 200, _("\
你可以用拳头来\n\
打败敌人。按[A]\n\
键跳跃，按[B]键\n\
出拳，按[A]键再\n\
按[B]键踢脚。如\n\
果你要把什么东\n\
西举起来，也是\n\
按[B]键，如果要\n\
把它们扔出去，\n\
再按一次[B]键。"))

DEFINE_DIALOG(DIALOG_016, 1, 3, 30, 200, _("\
跳上那个闪光的\n\
龟壳，乘着它到\n\
任何你想去的地\n\
方！用它还可以\n\
压碎那些敌人！"))

DEFINE_DIALOG(DIALOG_017, 1, 4, 30, 200, _("\
我是这里的统治\n\
者炸弹王。\n\
　\n\
你怎么敢爬上我\n\
的山？你凭什么\n\
站在我炸弹王的\n\
山顶？你虽然侥\n\
幸地躲过了我的\n\
守卫，但永远不\n\
可能逃出我的手\n\
掌心…\n\
　\n\
…你永远不可能\n\
夺走我的力量之\n\
星。马力欧，我\n\
现在就要和你决\n\
斗！\n\
　\n\
如果你要我的力\n\
量之星，你必须\n\
在决斗中证明你\n\
自己。\n\
　\n\
你可以从我身后\n\
抱起我，并把我\n\
摔到这皇室的草\n\
地上吗？我想你\n\
永远也办不到！"))

DEFINE_DIALOG(DIALOG_018, 1, 4, 30, 200, _("\
我好困阿…我要\n\
睡了…我可不希\n\
望被别人打扰。\n\
所以，请你走路\n\
轻一点。"))

DEFINE_DIALOG(DIALOG_019, 1, 2, 30, 200, _("\
嘘！在走廊里请\n\
放轻你的脚步！"))

DEFINE_DIALOG(DIALOG_020, 1, 6, 95, 150, _("\
亲爱的马力欧：\n\
请到城堡来，我\n\
特意为你烤了一\n\
个大蛋糕。\n\
　\n\
　　　　　　桃花公主"))

DEFINE_DIALOG(DIALOG_021, 1, 5, 95, 200, _("\
欢迎你啊！\n\
　\n\
这里没人！快滚\n\
吧！不要再回来\n\
了！\n\
　\n\
哇…哈哈…哈！"))

DEFINE_DIALOG(DIALOG_022, 1, 2, 95, 200, _("\
你需要一把钥匙\n\
来打开这扇门。"))

DEFINE_DIALOG(DIALOG_023, 1, 3, 95, 200, _("\
这把钥匙不行。\n\
也许这是地下室\n\
的钥匙。"))

DEFINE_DIALOG(DIALOG_024, 1, 5, 95, 200, _("\
你需要力量之星\n\
来打开这扇门。\n\
打败城堡中某幅\n\
壁画中的敌人，\n\
就能夺回一颗力\n\
量之心。"))

DEFINE_DIALOG(DIALOG_025, 1, 4, 95, 200, _("\
打开这扇门需要\n\
３颗力量之星。\n\
你还缺少[%]颗。"))

DEFINE_DIALOG(DIALOG_026, 1, 4, 95, 200, _("\
打开这扇门需要\n\
８颗力量之星。\n\
你还缺少[%]颗。"))

DEFINE_DIALOG(DIALOG_027, 1, 4, 95, 200, _("\
打开这扇门需要\n\
３０颗力量之星。\n\
你还缺少[%]颗。"))

DEFINE_DIALOG(DIALOG_028, 1, 4, 95, 200, _("\
打开这扇门需要\n\
５０颗力量之星。\n\
你还缺少[%]颗。"))

DEFINE_DIALOG(DIALOG_029, 1, 5, 95, 200, _("\
要打开通往\n\
“无尽的楼梯”\n\
的门需要７０颗\n\
力量之星。\n\
　\n\
哈…哈…哈！"))

DEFINE_DIALOG(DIALOG_030, 1, 6, 30, 200, _("\
　\n\
嗨！现在是朱盖\n\
木兄弟的现场插\n\
播，报道马力欧\n\
的最新进展。他\n\
已经学会了悄悄\n\
接近敌人的技\n\
巧，方法如下：\n\
马力欧为了不让\n\
脚步发出声音，\n\
必须走得非常缓\n\
慢。\n\
　\n\
再次重播以前报\n\
道过的摄像机使\n\
用技巧，按[C]◀键\n\
和[C]▶键从不同角\n\
度来看马力欧，\n\
按[C]▼键从远处观\n\
察马力欧。如果\n\
摄影机不能再移\n\
动了，我们会用\n\
嘟嘟声警告你。\n\
这里是朱盖木兄\n\
弟，现场报道完\n\
毕。"))

DEFINE_DIALOG(DIALOG_031, 1, 5, 30, 200, _("\
不可能！你又赢\n\
了我？！我花了\n\
所有的积蓄买了\n\
这双酷霸王１号\n\
火箭跑鞋。我想\n\
我应该把这颗力\n\
量之星交给胜利\n\
者，拿去吧！\n\
马力欧，\n\
恭喜你了！"))

DEFINE_DIALOG(DIALOG_032, 1, 5, 30, 200, _("\
如果你拿到了飞\n\
行帽，你就可以\n\
飞行了！带上飞\n\
行帽，来一个三\n\
级跳，在一条直\n\
线上连续跳三次\n\
就可以起飞了。\n\
如果你戴着飞行\n\
帽，从大炮里发\n\
射出来的话，你\n\
可以飞得更高！\n\
在飞行过程中，\n\
按[C]键可以左右\n\
环视，按[Z]键可\n\
以降落。"))

DEFINE_DIALOG(DIALOG_033, 1, 6, 30, 200, _("\
你好！你通过传\n\
送管道来到了\n\
桃花公主的城\n\
堡。手柄的使用\n\
很简单：按[A]键\n\
来跳跃，按[B]键\n\
来进攻或者读路\n\
牌，用摇杆来控\n\
制马力欧的行\n\
动。好了，向城\n\
堡出发！"))

DEFINE_DIALOG(DIALOG_034, 1, 6, 30, 200, _("\
下午好！这里是\n\
朱盖木兄弟在公\n\
主的城堡外向您\n\
现场报道！\n\
　\n\
马力欧已经到达\n\
了现场，我们将\n\
实况转播他在城\n\
堡找回丢失的力\n\
量之星。\n\
　\n\
作为转播专家，\n\
我们将选择最佳\n\
角度来拍摄，但\n\
你也可以按[C]键\n\
来控制。\n\
　\n\
如果摄影机不能\n\
再移动了，我们\n\
会用嘟嘟声警告\n\
你。你还可以停\n\
下来，按[C]▲键来\n\
观察周围情况。\n\
　\n\
按[A]键继续玩，\n\
按[R]键可以切换\n\
摄影机的视点。\n\
一路上还会有很\n\
多标记来帮你复\n\
习这些操作。\n\
　\n\
这是朱盖木兄弟\n\
向您现场报导！"))

DEFINE_DIALOG(DIALOG_035, 1, 5, 30, 200, _("\
这里一共有四个\n\
摄影机，或者说\n\
『[C]』键。按[C]▲键\n\
后，可以使用摇\n\
杆来环视四周。\n\
　\n\
一般来说，你会\n\
从朱盖木的摄影\n\
机来看马力欧。\n\
这是推荐使用的\n\
正常视点。\n\
　\n\
你可以按[C]▶键来\n\
改变角度。按[R]\n\
键，切换到马力\n\
欧的摄影机，摄\n\
影机紧跟在马力\n\
欧的身后。再按\n\
一次[R]键，切换\n\
到朱盖木的视\n\
点。不管用朱盖\n\
木的视点还是马\n\
力欧的视点，按\n\
[C]▼键来从远处观\n\
察马力欧。"))

DEFINE_DIALOG(DIALOG_036, 1, 5, 30, 200, _("\
了望台\n\
按[C]▲键环视四\n\
周。别遗漏任何\n\
东西哦。\n\
　\n\
按[R]键切换到马\n\
力欧的视点，再\n\
按一次[R]键切换\n\
回朱盖木的视\n\
点。暂停游戏，\n\
切换到“固定视\n\
点”模式，按[R]\n\
键把视点固定。\n\
去试试看吧！"))

DEFINE_DIALOG(DIALOG_037, 1, 2, 30, 200, _("\
我赢了！你输\n\
了！哈哈哈哈！\n\
你不慢，但是我\n\
是更好的滑雪运\n\
动员！"))

DEFINE_DIALOG(DIALOG_038, 1, 3, 95, 200, _("\
力量之星起作用\n\
了，门慢慢打开\n\
了。"))

DEFINE_DIALOG(DIALOG_039, 1, 4, 30, 200, _("\
炸弹王有旨：\n\
此处禁止参观。\n\
　\n\
我绝对不会放弃\n\
我的力量之星，\n\
它的光芒之下隐\n\
藏着城堡的能\n\
量。\n\
它是酷霸王赏赐\n\
给我的宝物，它\n\
会在我的国土里\n\
保存得很好的！\n\
我绝对不会透露\n\
它的位置。不\n\
过，可能有一点\n\
点提示：在每一\n\
个关卡的开始，\n\
注意力量之星的\n\
名字。\n\
　\n\
——炸弹王"))

DEFINE_DIALOG(DIALOG_040, 1, 3, 30, 200, _("\
注意！警告！\n\
下面是冰川的裂\n\
缝。"))

DEFINE_DIALOG(DIALOG_041, 1, 3, 30, 200, _("\
我赢了！你输\n\
了！哈哈哈！\n\
　\n\
这就是你和我喏\n\
库喏库比赛的结\n\
果！\n\
　\n\
下次祝你好运！"))

DEFINE_DIALOG(DIALOG_042, 1, 4, 30, 200, _("\
当心！独木桥！\n\
小心慢行！\n\
　\n\
你可以跳起抓住\n\
峭壁的边缘，悬\n\
挂在那里；慢慢\n\
地往悬崖边走，\n\
你也能抓住峭壁\n\
的边缘。当你想\n\
放手，可以按[Z]\n\
键或向马力欧身\n\
后的方向拉摇\n\
杆。向上推摇杆\n\
可以使马力欧爬\n\
上峭壁。按[A]键\n\
则是快速爬上峭\n\
壁。"))

DEFINE_DIALOG(DIALOG_043, 1, 5, 30, 200, _("\
如果你跳起来并\n\
且按住[A]键，你\n\
就可以挂在高处\n\
的物体上，就像\n\
你抓住天上的飞\n\
鸟一样。"))

DEFINE_DIALOG(DIALOG_044, 1, 5, 95, 200, _("\
是谁啊？谁吵醒\n\
我了？现在还是\n\
白天，我要睡\n\
觉！\n\
　\n\
喂！既然我醒\n\
了，就跟我一起\n\
来一次短途飞\n\
行，如何？按住\n\
[A]键抓住我，松\n\
开[A]键，跳下。\n\
只要我还飞得\n\
动，我会带你到\n\
任何你想去的\n\
地方。\n\
好了，我飞的时\n\
候你要抓牢，并\n\
注意我的影子。"))

DEFINE_DIALOG(DIALOG_045, 1, 6, 95, 200, _("\
哈呼…我快要飞\n\
不动了。马力\n\
欧，你应该紧急\n\
着陆了，按[A]键\n\
着陆。好吧，\n\
再见了，\n\
　\n\
再见！"))

DEFINE_DIALOG(DIALOG_046, 1, 5, 30, 200, _("\
你必须掌握非常\n\
重要的三种跳跃\n\
技巧。\n\
　\n\
首先，试试看三\n\
级跳。\n\
先快跑，然后连\n\
续跳三次，一、\n\
二、三！如果你\n\
掌握了正确的时\n\
机，你就会跳得\n\
非常高。\n\
　\n\
接下来是远跳。\n\
先跑起来，按[Z]\n\
键蹲下，然后按\n\
[A]键起跳，你可\n\
以跳得很远。\n\
　\n\
如果你要做踢墙\n\
跳，按[A]键对着\n\
墙起跳，当你碰\n\
到墙壁时再次起\n\
跳，你就可以跳\n\
得更高。\n\
　\n\
记住了吗？三级\n\
跳，远跳和踢墙\n\
跳。练习、练\n\
习、再练习！\n\
不学会它们，你\n\
是没有希望拿到\n\
所有的力量之星\n\
的。"))

DEFINE_DIALOG(DIALOG_047, 1, 2, 95, 200, _("\
嗨！我会为你准\n\
备好大炮！"))

DEFINE_DIALOG(DIALOG_048, 1, 4, 30, 200, _("\
雪山顶\n\
小心雪山路滑！\n\
请先去小木屋！"))

DEFINE_DIALOG(DIALOG_049, 1, 5, 30, 200, _("\
还记得那个踢墙\n\
跳的技巧吗？那\n\
是你到达非常高\n\
的地方必须要掌\n\
握的技巧。\n\
使用摇杆从一面\n\
墙跳到另一面\n\
墙，掌握好摇杆\n\
的方向来获得弹\n\
跳动力。记住！\n\
熟能生巧啊。"))

DEFINE_DIALOG(DIALOG_050, 1, 4, 30, 200, _("\
当你在斜面上\n\
时，按住[Z]键来\n\
蹲下滑行！\n\
或在空中时按[Z]\n\
键来用屁股重击\n\
地面！\n\
如果你站立不\n\
动，蹲下，再起\n\
跳，你就可来一\n\
个后空翻！\n\
记住了吗？\n\
还有，跑动时，\n\
蹲下起跳可以远\n\
跳，或是蹲下，\n\
爬行…\n\
哦，还是慢慢\n\
来，别担心学不\n\
会。"))

DEFINE_DIALOG(DIALOG_051, 1, 6, 30, 200, _("\
攀爬非常容易！\n\
如果你跳起来的\n\
时候，碰到树、\n\
旗杆或柱子，你\n\
会自动地抓住它\n\
们。如果再次按\n\
[A]键，就可以跳\n\
下。\n\
　\n\
当你抓住旗杆、\n\
柱子或是树时，\n\
可以左右拔动摇\n\
杆来围绕它们旋\n\
转。当你爬到顶\n\
时，向上推摇杆\n\
可以做一个单手\n\
倒立。以单手倒\n\
立姿势跳下时可\n\
以做一个漂亮的\n\
落地动作。"))

DEFINE_DIALOG(DIALOG_052, 1, 5, 30, 200, _("\
原地站立按[Z]键\n\
蹲下，再按[A]键\n\
可以做一个很高\n\
的后空翻。\n\
　\n\
如果你要做侧空\n\
翻，你可以先跑\n\
起来，做一个急\n\
转弯然后起跳。\n\
无论你是做后空\n\
翻还是侧空翻，\n\
你的滞空时间都\n\
很长。"))

DEFINE_DIALOG(DIALOG_053, 1, 5, 30, 200, _("\
有些时候，如果\n\
你穿过一个圆环\n\
或发现了一个隐\n\
藏地点，就会有\n\
一个红色的数字\n\
出现。\n\
如果你能触发５\n\
个这样的数字，\n\
就会有一个隐藏\n\
的力量之星出\n\
现。"))

DEFINE_DIALOG(DIALOG_054, 1, 5, 30, 200, _("\
欢迎来到冰雪滑\n\
道！准备好！把\n\
摇杆向前推可以\n\
加速，向后拉摇\n\
杆来减速。"))

DEFINE_DIALOG(DIALOG_055, 1, 4, 30, 200, _("\
嗨！马力欧，老\n\
兄，最近如何？\n\
你看起来好像雪\n\
滑得不错。我一\n\
看就知道你速度\n\
挺快。不过，你\n\
知道的，我可是\n\
世界滑雪冠军！\n\
你说什么？来场\n\
比赛？\n\
预备…　\n\
　\n\
　　开始！　　不"))

DEFINE_DIALOG(DIALOG_056, 1, 6, 30, 200, _("\
啊！你破了我的\n\
纪录！太让人难\n\
以置信了！你真\n\
是太棒了！你终\n\
于证明了你是最\n\
快的。\n\
我没有金牌给\n\
你，但可以给你\n\
这颗星星。\n\
你赢得了它！"))

DEFINE_DIALOG(DIALOG_057, 1, 4, 30, 200, _("\
天啊！我的孩\n\
子！你看到我的\n\
孩子了吗？她是\n\
我世界上最最爱\n\
的孩子啊。（人\n\
家都说她长得很\n\
像我）我怎么也\n\
想不起来我把她\n\
拉在什么地方\n\
了。\n\
让我仔细想想，\n\
我停下来抓\n\
鱼，找一些冰\n\
块，我，哦！\n\
　\n\
我还是想不起！"))

DEFINE_DIALOG(DIALOG_058, 1, 4, 30, 200, _("\
你找到了我最珍\n\
爱的孩子！你究\n\
竟到哪里去了\n\
啊？孩子！我要\n\
怎么感谢你才好\n\
呢？马力欧。\n\
哦，我有…这个\n\
力量之星。\n\
拿去，请接受我\n\
永远的感激之\n\
情。"))

DEFINE_DIALOG(DIALOG_059, 1, 4, 30, 200, _("\
那不是我的孩\n\
子！她根本一点\n\
都不像我！她的\n\
父母肯定担心死\n\
了！"))

DEFINE_DIALOG(DIALOG_060, 1, 4, 30, 200, _("\
注意！\n\
潜水必读！\n\
　\n\
如果你在水下潜\n\
的时间太长，你\n\
就会缺氧。\n\
　\n\
这时，你可以回\n\
到水面上换气，\n\
或在水底找一个\n\
气泡或硬币来呼\n\
吸。\n\
按[A]键游泳。按\n\
住[A]键可以慢慢\n\
地稳稳地游。有\n\
节奏地按[A]键可\n\
以加快游泳的速\n\
度。向上推摇\n\
杆，并且按[A]键\n\
来潜水。\n\
　\n\
向下拉摇杆，并\n\
同时按[A]键可以\n\
回到水面。\n\
　\n\
在接近水边的水\n\
面，向下拉摇\n\
杆，再按[A]键可\n\
以跳出水面。"))

DEFINE_DIALOG(DIALOG_061, 1, 4, 30, 200, _("\
　\n\
注意！这里的水\n\
很冷。千万不要\n\
在这里游泳！\n\
不是玩笑！\n\
　\n\
——企鹅"))

DEFINE_DIALOG(DIALOG_062, 1, 3, 30, 200, _("\
藏在绿色砖块里\n\
的就是神奇的金\n\
属帽。\n\
戴上它，你就可\n\
以不怕火烧，也\n\
不用担心敌人的\n\
攻击，甚至在水\n\
里你都不用呼\n\
吸。\n\
　\n\
但唯一的缺点就\n\
是：你不能游泳\n\
了！"))

DEFINE_DIALOG(DIALOG_063, 1, 5, 30, 200, _("\
隐身帽就藏在蓝\n\
色的砖块里。如\n\
果你戴上它，眼\n\
睛先生也会被你\n\
迷惑，因为谁也\n\
看不见你。\n\
就连大嘘嘘鬼也\n\
会被你骗过去。\n\
你还可以穿过一\n\
些秘密的墙壁。"))

DEFINE_DIALOG(DIALOG_064, 1, 5, 30, 200, _("\
当你戴上了从红\n\
色砖块里得到的\n\
飞行帽时，你就\n\
可以通过三级跳\n\
起飞。\n\
用摇杆控制马力\n\
欧的方向，向下\n\
拉摇杆可以上\n\
升，向上推摇杆\n\
下降。按[Z]键着\n\
陆。"))

DEFINE_DIALOG(DIALOG_065, 1, 6, 30, 200, _("\
接下来是游泳\n\
课！\n\
按[A]键来蛙泳，\n\
如果你按键频率\n\
合适，就可以游\n\
得很快。\n\
　\n\
按住[A]键可以打\n\
水前进，虽然\n\
慢，但很稳。向\n\
上推摇杆可以潜\n\
水，向下拉则是\n\
回到水面上。如\n\
果要跳出水面，\n\
则是向下拉住摇\n\
杆，然后按[A]键\n\
就可以了。\n\
　\n\
怎么样，很简单\n\
吧！\n\
　\n\
别忘了，马力欧\n\
在水底是不能呼\n\
吸的，如果能量\n\
表的值很低的时\n\
候，记得回到水\n\
面上让马力欧喘\n\
一下气。\n\
　\n\
还有一件事情：\n\
你不能够打开水\n\
下的门。"))

DEFINE_DIALOG(DIALOG_066, 1, 5, 30, 200, _("\
马力欧，是我，\n\
桃花公主！\n\
　\n\
你一定要小心！\n\
酷霸王非常残\n\
忍！他会喷出恐\n\
怖的火焰把你烧\n\
成焦炭。你要绕\n\
到他的后面，按\n\
[B]键抓住它的尾\n\
巴。然后旋转摇\n\
杆，你转得越\n\
快，你就可以把\n\
他扔得越远。\n\
　\n\
按[C]键环视四周。\n\
你必须把酷霸王\n\
扔到四个角落的\n\
炸弹上。瞄准好\n\
后，再按[B]键把\n\
酷霸王扔出去。\n\
　\n\
祝你好运，马力\n\
欧，我们的命运\n\
就靠你了。"))

DEFINE_DIALOG(DIALOG_067, 1, 5, 30, 200, _("\
你的运气真是太\n\
好了，马力欧！\n\
桃花公主并不在\n\
这里。哈哈哈！\n\
好了，来吧，看\n\
看你能不能抓住\n\
我的尾巴！象你\n\
这样的懦夫不可\n\
能把我扔出去！\n\
决不可能！\n\
哈哈。"))

DEFINE_DIALOG(DIALOG_068, 1, 5, 30, 200, _("\
这里是岩浆地\n\
狱！\n\
如果你不小心被\n\
火烧到，或是掉\n\
进了岩浆，你会\n\
被烫得满地乱\n\
跳。但你仍然可\n\
以控制马力欧。\n\
只要你保持冷\n\
静。"))

DEFINE_DIALOG(DIALOG_069, 1, 6, 30, 200, _("\
有时，你会在壁\n\
画世界的尽头撞\n\
上一些看不见的\n\
墙壁，如果你正\n\
在飞行的话，就\n\
会被反弹回来。"))

DEFINE_DIALOG(DIALOG_070, 1, 5, 30, 200, _("\
你可以随时从壁\n\
画的世界返回到\n\
城堡。让马力欧\n\
停下来后，\n\
按ＳＴＡＲＴ键\n\
暂停游戏，选择\n\
“退出关卡”就\n\
可以了。\n\
　\n\
你并不需要在一\n\
个关卡中找到所\n\
有的力量之星再\n\
到另一个关卡中\n\
去。\n\
　\n\
你可以先到其它\n\
地方去找力量之\n\
星，然后再回来\n\
拿比较难获得的\n\
力量之星，这时\n\
你也会变得熟练\n\
多了。\n\
　\n\
每当你找到一颗\n\
力量之星时，关\n\
于下一颗星的提\n\
示就会显示到那\n\
一关卡的开始画\n\
面上。\n\
　\n\
当然，你可以去\n\
寻找任何一颗力\n\
量之星，并不一\n\
定要去找提示所\n\
指的那一颗。"))

DEFINE_DIALOG(DIALOG_071, 1, 3, 30, 200, _("\
前方危险！\n\
当心奇怪的烟！\n\
不要吸气！如果\n\
感到眩晕，跑到\n\
更高处去呼吸呼\n\
吸新鲜的空气！\n\
圆圈：躲避所\n\
箭头：出入口"))

DEFINE_DIALOG(DIALOG_072, 1, 5, 30, 200, _("\
前面有大风！把\n\
帽子戴紧！以免\n\
被风吹走，否\n\
则，你必须在这\n\
座山找回你的帽\n\
子。"))

DEFINE_DIALOG(DIALOG_073, 1, 4, 95, 200, _("\
啊哈，朋友，这\n\
里有我沉没的财\n\
宝。如果你想得\n\
到它的话，你要\n\
按照正确的顺序\n\
打开箱子。是什\n\
么顺序呢？你知\n\
道吗？\n\
　\n\
我是决不会说出　\n\
来的。\n\
　\n\
——船长"))

DEFINE_DIALOG(DIALOG_074, 1, 5, 30, 200, _("\
你可以抓住悬崖\n\
或一些建筑物的\n\
边缘，并悬挂在\n\
上面。\n\
　\n\
如果想跳下来，\n\
向马力欧背对的\n\
方向拉摇杆，或\n\
按[Z]键。\n\
要爬上悬崖，可\n\
以向上推摇杆或\n\
按[A]键，这样可\n\
以快速地爬上悬\n\
崖。"))

DEFINE_DIALOG(DIALOG_075, 1, 5, 30, 200, _("\
马力欧！！我的\n\
城堡陷入了危\n\
机。我知道这是\n\
酷霸王干的，而\n\
且我知道你是唯\n\
一可以解救我们\n\
的人！\n\
城堡里的门已经\n\
被酷霸王封起来\n\
了，只有力量之\n\
星的能量才能打\n\
开它们。\n\
　\n\
但是城堡里还有\n\
一些秘密通道，\n\
酷霸王还没有发\n\
现它们。\n\
　\n\
其中一个通道就\n\
在这个房间里，\n\
而且那里还有一\n\
颗力量之星！\n\
　\n\
马力欧，去找到\n\
这颗隐藏的力量\n\
之星吧，它会帮\n\
助你的。请你一\n\
定要救救我们，\n\
帮我们找回所有\n\
的力量之星，把\n\
我们从这个恐怖\n\
的监狱中解救出\n\
来。"))

DEFINE_DIALOG(DIALOG_076, 1, 6, 30, 200, _("\
感谢力量之星的\n\
能量，城堡又恢\n\
复了生机。马力\n\
欧，你一定要给\n\
酷霸王最后一击。\n\
　\n\
现在，让我告诉\n\
你一些关于城堡\n\
的秘密吧。在那\n\
些有镜子的房间\n\
里，仔细的去找\n\
一些在镜子中不\n\
反射的东西。等\n\
你去水城的时\n\
候，你可以来一\n\
个超高跳，跳进\n\
壁画当中。猜猜\n\
看，我们会看见\n\
什么？"))

DEFINE_DIALOG(DIALOG_077, 1, 2, 150, 200, _("\
你要去撞击这里\n\
的柱子，这是法\n\
令！"))

DEFINE_DIALOG(DIALOG_078, 1, 5, 30, 200, _("\
你可以按[Z]键用\n\
力撞击地面上的\n\
蓝色硬币砖块去\n\
获得蓝色硬币。\n\
一个蓝色硬币相\n\
当于五个黄色硬\n\
币。但是你的动\n\
作一定要快，否\n\
则它就会消失，\n\
那就太可惜了。"))

DEFINE_DIALOG(DIALOG_079, 1, 4, 30, 200, _("\
哇哦！放我走！\n\
嘻嘻！我只是开\n\
个玩笑而已。难\n\
道你没有点幽默\n\
感吗？\n\
但是，你听我\n\
说，我们做个交\n\
易吧。如果你放\n\
我走的话，我可\n\
以给你一个难得\n\
的宝物。\n\
　\n\
怎么样？接受我\n\
的条件吗？\n\
　\n\
　　放　　　　　　　　不放"))

DEFINE_DIALOG(DIALOG_080, 1, 1, 30, 200, _("\
咿嘿嘿嘿！"))

DEFINE_DIALOG(DIALOG_081, 1, 4, 30, 200, _("\
神秘的水位。\n\
答案在哪里呢？\n\
这座城市非常欢\n\
迎那些当他们进\n\
入时有深度的访\n\
问者。"))

DEFINE_DIALOG(DIALOG_082, 1, 4, 30, 200, _("\
带好你的帽子\n\
啊，如果你丢了\n\
帽子，你会很容\n\
易受到敌人的伤\n\
害。\n\
　\n\
如果你真的丢了\n\
帽子的话，你要\n\
在这个关卡中找\n\
到它。它就在你\n\
丢掉的地方。\n\
哦，孩子，桃花\n\
公主的情况看起\n\
来不太好，她现\n\
在还被困在城堡\n\
的某面墙里。你\n\
一定要帮助她\n\
啊。你知道墙里\n\
的世界有很多敌\n\
人吗？真的！酷\n\
霸王的军队也在\n\
那里。哦，这个\n\
给你吧，我早为\n\
你准备好了。"))

DEFINE_DIALOG(DIALOG_083, 1, 6, 30, 200, _("\
这个钟有一点奇\n\
怪啊，你跳进去\n\
的时候，注意那\n\
个大指针的位\n\
置。噢，你瞧我\n\
发现了什么！这\n\
里！马力欧，快\n\
来啊！"))

DEFINE_DIALOG(DIALOG_084, 1, 3, 30, 200, _("\
哦！放开我，你\n\
这个家伙！我要\n\
迟到了！已经这\n\
么晚了！我必须\n\
要赶快了！什\n\
么？这个闪闪发\n\
光的东西？是我\n\
的！我是发现\n\
者！收藏者！失\n\
主！啊！晚了，\n\
来不及了，迟到\n\
了！哦！拿去！\n\
那是酷霸王的礼\n\
物！\n\
好了，快让我走\n\
吧！我有约会！\n\
我不能迟到！"))

DEFINE_DIALOG(DIALOG_085, 1, 5, 30, 200, _("\
你在这个房子里\n\
是不会有机会\n\
的。如果你走出\n\
这里一步，你就\n\
会得到……盗墓者\n\
…奖章　"))

DEFINE_DIALOG(DIALOG_086, 1, 3, 30, 200, _("\
一直绕圈跑可以\n\
让一些坏家伙眼\n\
花缭乱。"))

DEFINE_DIALOG(DIALOG_087, 1, 4, 30, 200, _("\
不光是圣诞老人\n\
才可以钻进烟\n\
囱，你也可以，\n\
请进吧。\n\
　\n\
——小屋主人"))

DEFINE_DIALOG(DIALOG_088, 1, 5, 30, 200, _("\
工作电梯\n\
如果要从这里出\n\
去，抓住左边的\n\
柱子，小心地滑\n\
下去。"))

DEFINE_DIALOG(DIALOG_089, 1, 5, 95, 200, _("\
两条路都充满了\n\
危险。小心啊。\n\
如果你现在还不\n\
会远跳，啧啧，\n\
走右边的一条路\n\
吧。\n\
　\n\
右：工作电梯　\n\
　　　　　　浓雾迷宫\n\
　\n\
左：黑洞\n\
　　　　　　地下湖\n\
　\n\
红色圆圈：\n\
　　　　　　　　电梯２\n\
　　　　　　　　地下湖\n\
　　　　　\n\
箭头：你在这里"))

DEFINE_DIALOG(DIALOG_090, 1, 6, 30, 200, _("\
哇哈哈哈！\n\
你终于落入我的\n\
陷阱了！我果然\n\
没有猜错。我警\n\
告你，『朋友』！\n\
当心你的脚步！"))

DEFINE_DIALOG(DIALOG_091, 2, 2, 30, 200, _("\
危险！\n\
狂风！\n\
但你可以乘风而\n\
行。"))

DEFINE_DIALOG(DIALOG_092, 1, 5, 30, 200, _("\
又是你！马力\n\
欧！你又来烦我\n\
了！难道你没看\n\
见我刚刚开心一\n\
会儿吗？快点把\n\
那些星星还给\n\
我！我的手下们\n\
需要它们！\n\
哈哈哈！"))

DEFINE_DIALOG(DIALOG_093, 1, 5, 30, 200, _("\
马力欧！又是\n\
你！正好，我正\n\
想吐火烤烤什么\n\
东西！你的星星\n\
对我根本没有作\n\
用！你的朋友们\n\
都被困在墙壁里\n\
了…\n\
你再也看不到桃\n\
花公主了！\n\
哈哈哈哈！"))

DEFINE_DIALOG(DIALOG_094, 1, 4, 30, 200, _("\
如何顺利地跑上\n\
斜坡呢？还记不\n\
记得远跳？跑起\n\
来，按[Z]键再起\n\
跳！"))

DEFINE_DIALOG(DIALOG_095, 1, 4, 30, 200, _("\
你可以站在一个\n\
标记的前面，按\n\
[B]键来读上面的\n\
内容。\n\
　\n\
当你要和别人讲\n\
话时，站在他们\n\
面前，按[B]键。\n\
一定要夺回这一\n\
关卡酷霸王偷走\n\
的力量之星。"))

DEFINE_DIALOG(DIALOG_096, 1, 4, 30, 200, _("\
从这里开始，路\n\
会变得很窄。当\n\
心点。任何人都\n\
不可以去山顶。\n\
如果你不想有什\n\
么意外的话，记\n\
得放慢你的脚\n\
步，轻轻地走，\n\
千万别吵醒正在\n\
睡觉的人。"))

DEFINE_DIALOG(DIALOG_097, 1, 5, 30, 200, _("\
别做胆小鬼啊。\n\
如果有人要推你\n\
的话，用力反击\n\
吧。这可是一对\n\
一的较量，失败\n\
者是不会有好下\n\
场的。"))

DEFINE_DIALOG(DIALOG_098, 1, 2, 95, 200, _("\
快到这儿来…　\n\
呵…呵呵…　"))

DEFINE_DIALOG(DIALOG_099, 1, 5, 95, 200, _("\
哦呵呵…　\n\
你是我的了。\n\
哼哼！\n\
我可以安然无恙\n\
地穿过这面墙，\n\
你能吗？\n\
呵呵…呵呵……　"))

DEFINE_DIALOG(DIALOG_100, 1, 3, 95, 200, _("\
哈，我拦住它\n\
啦！是我的啦！\n\
嘿，嘿，嘿嘿！"))

DEFINE_DIALOG(DIALOG_101, 1, 3, 95, 200, _("\
啊欠，走…吧…　\n\
你让我透不过气\n\
了，咳呵，我被\n\
你害苦了！这顶\n\
帽子？哦，好\n\
吧，拿去吧。这\n\
顶帽子真酷，不\n\
过，我会还回来\n\
的。我觉得我比\n\
你更合适戴它。\n\
呵呵…呵呵…　"))

DEFINE_DIALOG(DIALOG_102, 1, 5, 30, 200, _("\
嘘，这些嘘嘘鬼\n\
非常非常害羞，\n\
如果你看着它们，\n\
它们就会消失。\n\
但如果你转过\n\
身，它们就会重\n\
新出现。在它们\n\
消失时攻击它们\n\
是没用的，你要\n\
悄悄地绕到它们\n\
身后才能打到它\n\
们。"))

DEFINE_DIALOG(DIALOG_103, 1, 4, 95, 200, _("\
四个塔上一定有\n\
一个塔在发光…\n\
在那个塔的顶\n\
端将可以看到\n\
灯光在闪烁。"))

DEFINE_DIALOG(DIALOG_104, 1, 5, 30, 200, _("\
在你面前暗色的\n\
星星只是一个\n\
『星星的标记』。\n\
当你收集到所有\n\
８枚红色硬币，\n\
星星就在这里出\n\
现。"))

DEFINE_DIALOG(DIALOG_105, 1, 3, 95, 200, _("\
准备发射！来\n\
吧，跳进大炮！\n\
　\n\
你可以用四门大\n\
炮到达有星星的\n\
空中岛屿，用摇\n\
杆瞄准，然后按\n\
[A]键发射。\n\
　\n\
如果你够敏捷，\n\
抓住小树或杆\n\
子，你便可以登\n\
上小岛了。"))

DEFINE_DIALOG(DIALOG_106, 1, 2, 95, 200, _("\
准备发射！来吧，\n\
跳进大炮！"))

DEFINE_DIALOG(DIALOG_107, 1, 3, 95, 200, _("\
鬼，鬼…　\n\
不要…　\n\
…死了！\n\
呵呵…呵呵…　\n\
你能…活着离\n\
开这里吗？"))

DEFINE_DIALOG(DIALOG_108, 1, 2, 95, 200, _("\
轰！这个城堡的\n\
恶作剧之王大嘘\n\
嘘鬼来啦。\n\
哈哈…哈哈…　"))

DEFINE_DIALOG(DIALOG_109, 1, 4, 95, 200, _("\
哦…不…　\n\
跟你说说我丧失\n\
身体的经历吧，\n\
我的身体已经融\n\
化掉了！有没有\n\
人拖你寻找脑\n\
袋？我一定可以\n\
得到一个新的身\n\
体的！哦，我的\n\
脸可能会冻成这\n\
样！"))

DEFINE_DIALOG(DIALOG_110, 1, 5, 95, 200, _("\
我需要在肩上架\n\
个好脑袋。你知\n\
道谁需要强壮的\n\
身体？如果你知\n\
道的话，我就跟\n\
你走。"))

DEFINE_DIALOG(DIALOG_111, 1, 4, 95, 200, _("\
太好了！多完美\n\
的身体啊！这是\n\
给你的礼物，我\n\
担保它能使你觉\n\
得更温暖。"))

DEFINE_DIALOG(DIALOG_112, 1, 4, 30, 200, _("\
尽量收集更多的\n\
硬币！它们能补\n\
充你的能量值。\n\
　\n\
你可以检查一下\n\
你在１５个关卡\n\
里一共收集了多\n\
少硬币。\n\
　\n\
你也可以触摸旋\n\
转的心来恢复能\n\
量。\n\
　\n\
你越快穿过心，\n\
就能恢复越多的\n\
能量。"))

DEFINE_DIALOG(DIALOG_113, 1, 6, 30, 200, _("\
红色，绿色，蓝\n\
色的砖块里藏有\n\
很特殊的帽子。\n\
踩在隐秘关卡里\n\
的开关上就可以\n\
激活这些藏有帽\n\
子的砖块。"))

DEFINE_DIALOG(DIALOG_114, 1, 5, 95, 200, _("\
真让人气愤！我\n\
们帮你建造房屋\n\
和城堡，铺设道\n\
路，你却还在我\n\
们身上散步。你\n\
说过一声谢谢\n\
吗？没有！\n\
好吧，既然你不\n\
准备从我身上拿\n\
开你的臭脚，那\n\
我就要把你压\n\
碎！\n\
来吧，懦夫！"))

DEFINE_DIALOG(DIALOG_115, 1, 5, 95, 200, _("\
不，又被压碎\n\
了！我只是一块\n\
垫脚的石头而\n\
已，不是沙砾。\n\
嗯，我投降，你\n\
赢了，拿去吧！"))

DEFINE_DIALOG(DIALOG_116, 1, 5, 95, 200, _("\
什…么…　\n\
你就是打败炸弹\n\
王的小东西？你\n\
也许能很快打败\n\
我，但是如果你\n\
想抓住酷霸王的\n\
尾巴，你就必须\n\
更快！我想我的\n\
手下会从你这儿\n\
得到一些教训，\n\
马力欧，我会遵\n\
守诺言，这是你\n\
的星星。\n\
　\n\
如果你想再见到\n\
我，你可以从菜\n\
单里选择这颗星\n\
星。再见啦！！"))

DEFINE_DIALOG(DIALOG_117, 1, 2, 95, 200, _("\
谁…在…走？\n\
谁…打破了…\n\
封印？\n\
谁…吵醒了…\n\
老人？\n\
我们不喜欢光…　\n\
哦哦哦哦…　\n\
我们不喜欢入侵\n\
者…　\n\
战斗吧…　\n\
来吧…\n\
来吧…！"))

DEFINE_DIALOG(DIALOG_118, 1, 6, 95, 200, _("\
哦…哦…哦…\n\
怎么啦？\n\
我们怎么像鹅卵\n\
石一样被压碎\n\
了？你太强大\n\
了！你统治了古\n\
老的金字塔。\n\
今天…　\n\
你获得了力量之\n\
星…　\n\
我们沉睡在…　\n\
在黑暗中…　"))

DEFINE_DIALOG(DIALOG_119, 1, 6, 30, 200, _("\
啊，我太粗心。\n\
这出乎了我的意\n\
料…但我仍然拥\n\
有星星的力量，\n\
拥有桃花公主。\n\
哈哈…哈哈…　\n\
你不会再从我这\n\
儿得到任何星\n\
星！我跟你没\n\
完，不过，我先\n\
放你走，你会为\n\
此付出代价的！"))

DEFINE_DIALOG(DIALOG_120, 1, 4, 30, 200, _("\
噢！我输了？星\n\
星的力量打败了\n\
我…　\n\
这次打个平手。\n\
下次，我的状态\n\
会很好的。\n\
　\n\
如果你现在想要\n\
见你可爱的公\n\
主，到塔的最顶\n\
层来吧。\n\
我等着你！\n\
哈哈哈哈…　"))

DEFINE_DIALOG(DIALOG_121, 1, 5, 30, 200, _("\
不，不可能！\n\
你打败了我，马\n\
力欧？！我给了\n\
那些军队力量，\n\
但是它们正在消\n\
失！啊！我看到\n\
和平正在重回世\n\
界！我无法忍\n\
受！哼…一切还\n\
没有结束…　\n\
\n\
来，我的军队！\n\
让我们一起来看\n\
看这场战斗的结\n\
局！\n\
哈哈…"))

DEFINE_DIALOG(DIALOG_122, 1, 4, 30, 200, _("\
黑洞\n\
右：工作电梯　\n\
　　　　　　浓雾迷宫\n\
　\n\
左：黑洞\n\
　　　　　　地下湖"))

DEFINE_DIALOG(DIALOG_123, 1, 4, 30, 200, _("\
金属洞穴\n\
右：通向瀑布\n\
左：金属帽开关"))

DEFINE_DIALOG(DIALOG_124, 1, 4, 30, 200, _("\
工作电梯\n\
危险！\n\
请仔细阅读使用\n\
说明！\n\
电梯会朝激活的\n\
箭头方向行驶。"))

DEFINE_DIALOG(DIALOG_125, 1, 3, 30, 200, _("\
迷失洞窟出口\n\
危险！已关闭。\n\
请往回走。"))

DEFINE_DIALOG(DIALOG_126, 2, 3, 30, 200, _("\
上：黑洞\n\
右：工作电梯\n\
　　　　　　迷失洞窟"))

DEFINE_DIALOG(DIALOG_127, 3, 4, 30, 200, _("\
地下湖泊\n\
右：金属洞穴\n\
左：废弃矿洞\n\
　　　　（关闭）\n\
　\n\
这里住着一条温\n\
顺的海龙王，敲\n\
打它的后背可以\n\
让它低下头。可\n\
别成为它的午餐\n\
噢！"))

DEFINE_DIALOG(DIALOG_128, 1, 4, 95, 200, _("\
你和我战斗必须\n\
尊敬我！你把我\n\
扔到圈外是违反\n\
皇室规则的。"))

DEFINE_DIALOG(DIALOG_129, 1, 5, 30, 200, _("\
欢迎来到护城河\n\
里的隐身帽关\n\
卡！当你踏上帽\n\
子的开关，所有\n\
的蓝色砖块就会\n\
变成实心。当你\n\
戴上隐身帽时，\n\
你会消失，并且\n\
可以躲避敌人和\n\
穿越许多障碍。\n\
快去试一试吧！"))

DEFINE_DIALOG(DIALOG_130, 1, 5, 30, 200, _("\
欢迎来到金属帽\n\
的瀑布石洞关\n\
卡！一旦你踩上\n\
金属帽开关，绿\n\
色的砖块会变成\n\
实心的。当你戴\n\
上金属帽后，你\n\
就可以在水下漫\n\
步了！快去试一\n\
试吧！"))

DEFINE_DIALOG(DIALOG_131, 1, 5, 30, 200, _("\
欢迎来到飞行帽\n\
之塔关卡！踩上\n\
位于彩虹塔顶的\n\
红色开关，所有\n\
的红色砖块将变\n\
为实心的。\n\
　\n\
快戴上飞行帽！\n\
来个三级跳，按\n\
[Z]键着陆。\n\
　\n\
就象你驾驶飞机\n\
一样，遥杆向下\n\
拉时，飞机上\n\
升；向前推时，\n\
飞机下降。"))

DEFINE_DIALOG(DIALOG_132, 1, 4, 30, 200, _("\
哇哦，马力欧，\n\
你不许耍赖哦！\n\
不能抄近路哦！\n\
现在，我知道你\n\
懂道理。这次，\n\
你被取消资格！\n\
下次，我们再公\n\
平竞争！"))

DEFINE_DIALOG(DIALOG_133, 1, 6, 30, 200, _("\
见到你真高兴！\n\
公主…我…这么\n\
说吧，大家都被\n\
困在城堡的墙壁\n\
里了。\n\
　\n\
酷霸王偷走了城\n\
堡的力量之星，\n\
他正利用城堡之\n\
星的力量创造自\n\
己的壁画和墙壁\n\
里的世界。\n\
　\n\
请快去找力量之\n\
星！一旦找到它\n\
们，你可以借助\n\
它们的力量打开\n\
被酷霸王封印的\n\
门。\n\
　\n\
第一层有四个房\n\
间。你可以从有\n\
炸弹人画像的房\n\
间开始。那是唯\n\
一没有被他封印\n\
的房间。当你收\n\
集到八颗力量之\n\
星，你就可以打\n\
开那个有颗巨大\n\
星星的门。公主\n\
就在那等你呢！"))

DEFINE_DIALOG(DIALOG_134, 1, 5, 30, 200, _("\
力量之星的名称\n\
也是找到它们的\n\
提示哦。它们会\n\
在每关开始时出\n\
现。\n\
　\n\
你不用按顺序收\n\
集。如果你不去\n\
找一些特殊的星\n\
星，你就会找不\n\
到一些其它的星\n\
星、敌人或特殊\n\
的物品。\n\
等你收集到一些\n\
力量之星后，你\n\
就可以尝试其它\n\
关卡了。\n\
我们都要指望你\n\
了！"))

DEFINE_DIALOG(DIALOG_135, 1, 5, 30, 200, _("\
我亲眼看见酷霸\n\
王偷走了星星！\n\
　\n\
他在每个关卡里\n\
藏了六颗星星，\n\
但是除非你激活\n\
了几个特殊帽子\n\
的开关，你才能\n\
找到全部的星\n\
星。\n\
　\n\
如果你想去见见\n\
那些被你打败的\n\
敌人，只要选择\n\
你从他那里得到\n\
的星星的名字就\n\
可以了。"))

DEFINE_DIALOG(DIALOG_136, 1, 6, 30, 200, _("\
哇哦！你已经获\n\
得到那么多力量\n\
之星啦？\n\
加油，马力欧！\n\
我打赌你一定马\n\
上就可以带我们\n\
离开这里了！\n\
　\n\
尽管这样，你还\n\
是要小心点。酷\n\
霸王他们一伙人\n\
设了许多陷阱。\n\
听我的话：当你\n\
要恢复能量时，\n\
记得去收集硬\n\
币。黄色的可以\n\
恢复一格能量；\n\
红色的可以恢复\n\
两格，蓝色的可\n\
以恢复五格哦！\n\
　\n\
只要压碎蓝色硬\n\
币的砖块，蓝色\n\
硬币就会出现。\n\
　\n\
当然，如果你从\n\
很高的地方掉下\n\
来，你也可以在\n\
着陆时重击地面\n\
来减轻伤害。"))

DEFINE_DIALOG(DIALOG_137, 1, 6, 30, 200, _("\
谢谢，马力欧！\n\
因为你夺回了力\n\
量之星，把酷霸\n\
王从这里赶了出\n\
去，城堡恢复了\n\
能量。\n\
哦，顺便问一\n\
下，你收集硬币\n\
了吗？在这１５\n\
个关卡里，每收\n\
集到１００枚硬\n\
币就会出现一个\n\
特殊的星星哦！"))

DEFINE_DIALOG(DIALOG_138, 1, 3, 30, 200, _("\
下面：地下湖\n\
左面：黑洞\n\
右面：迷失洞窟\n\
　　　　　　　（已关闭）"))

DEFINE_DIALOG(DIALOG_139, 1, 6, 30, 200, _("\
上面：自动电梯\n\
电梯自动启动，\n\
到达预定关卡。\n\
它也会自动消\n\
失！。"))

DEFINE_DIALOG(DIALOG_140, 1, 6, 30, 200, _("\
电梯区域：\n\
右边：迷失洞窟\n\
　　　　　　　　　入口\n\
左边：黑洞入口\n\
　　　　　　　　　电梯　１\n\
箭头：你在这里"))

DEFINE_DIALOG(DIALOG_141, 1, 5, 150, 200, _("\
你找到了１颗被\n\
盗的力量之星！\n\
现在你可以打开\n\
城堡里一些被封\n\
印的门了。\n\
试一试二楼公主\n\
的房间和一楼的\n\
有嘭嘭要塞壁画\n\
的房间。\n\
酷霸王那伙人仍\n\
然在不断强大之\n\
中，所以你不能\n\
掉以轻心。快来\n\
救我们吧，马力\n\
欧！继续寻找力\n\
量之星！"))

DEFINE_DIALOG(DIALOG_142, 1, 5, 150, 200, _("\
你已经夺回了３\n\
颗力量之星啦！\n\
现在你可以打开\n\
有３标记的大门\n\
了。\n\
　\n\
如果你乐意，你\n\
可以从打开封印\n\
的关卡回来。前\n\
面的敌人很难\n\
缠，所以一定小\n\
心！"))

DEFINE_DIALOG(DIALOG_143, 1, 6, 150, 200, _("\
你夺回了８颗力\n\
量之星了哦！现\n\
在你可以打开那\n\
个有大星星的门\n\
了！但是酷霸王\n\
也在那里…你听\n\
见公主的声音了\n\
吗？"))

DEFINE_DIALOG(DIALOG_144, 1, 6, 150, 200, _("\
你夺回了３０颗\n\
力量之星了哦！\n\
现在你可以打开\n\
那个有大星星的\n\
门了！但在你走\n\
之前，那些事情\n\
做的怎么样了？\n\
　\n\
你有没有把那两\n\
个圆柱压下去？\n\
你也没有把你的\n\
帽子给丢了吧？\n\
如果掉了，你就\n\
不得不到秃鹫强\n\
哥那里去把它找\n\
回来！\n\
他们说酷霸王已\n\
经潜出大海，进\n\
入地下了。你有\n\
没有把他困住？"))

DEFINE_DIALOG(DIALOG_145, 1, 6, 150, 200, _("\
你夺回了５０颗\n\
力量之星啊！\n\
现在快去三楼打\n\
开星星之门。\n\
酷霸王就在那里\n\
等你。\n\
　\n\
你找到了所有的\n\
金属帽开关了\n\
么？红的，绿的\n\
和蓝的？你从彩\n\
色砖块里得到的\n\
帽子很有用的。\n\
抓紧吧，快去第\n\
三层吧。"))

DEFINE_DIALOG(DIALOG_146, 1, 6, 150, 200, _("\
你已经找到了\n\
７０颗力量之星\n\
了！你揭开了无\n\
尽楼梯的秘密，\n\
真是多亏了你\n\
——酷霸王就在最\n\
上面！去吧！\n\
去迎接你最后的\n\
挑战吧！"))

DEFINE_DIALOG(DIALOG_147, 1, 5, 30, 200, _("\
你用了帽子砖块\n\
了吗？说真的，\n\
你应该用用哦！\n\
　\n\
你要按下城堡隐\n\
藏关卡的彩色的\n\
帽子开关，才能\n\
使它们都变成实\n\
心的，这样你才\n\
可以撞碎。\n\
想去隐藏关卡\n\
吗？重新获得一\n\
些力量之星就行。\n\
　\n\
帽子砖块非常有\n\
用！红色的是飞\n\
行帽；绿的是金\n\
属帽；蓝的是隐\n\
形帽。"))

DEFINE_DIALOG(DIALOG_148, 1, 6, 30, 200, _("\
雪人之山就在前\n\
面了！当心啊！\n\
不要企图用三级\n\
跳越过冰块射手\n\
哦。\n\
　\n\
如果你掉进了冰\n\
水池塘，你的能\n\
量会迅速减少，\n\
而且不会自动恢\n\
复。\n\
　　　　　　　－雪人"))

DEFINE_DIALOG(DIALOG_149, 1, 3, 30, 200, _("\
欢迎来到桃花公\n\
主的秘密滑道！\n\
这里有藏着一颗\n\
连酷霸王都找不\n\
到的星星哦！\n\
在下滑过程中，\n\
遥杆向前加速，\n\
向后当然是减速\n\
啦。如果你滑得\n\
够快的话，你会\n\
赢得星星哦！"))

DEFINE_DIALOG(DIALOG_150, 1, 5, 30, 200, _("\
哇啊啊啊！你淹\n\
了我的房子啊！\n\
为什么啊？看看\n\
这里乱糟糟的！\n\
我该怎么办啊？\n\
　\n\
屋顶蹋了，地板\n\
淹了…该怎么办\n\
啊，该怎么办\n\
啊？呜…呜…　\n\
我要疯了！！！\n\
当我得到这星星\n\
时，所有的事情\n\
都开始变糟了…\n\
这颗亮晶晶的星\n\
星，让我感觉怪\n\
怪的…　"))

DEFINE_DIALOG(DIALOG_151, 1, 4, 30, 200, _("\
我再也受不了\n\
了！你踩在我湿\n\
透的身上，现在\n\
我真的要疯了！\n\
哇啊…　"))

DEFINE_DIALOG(DIALOG_152, 1, 3, 30, 200, _("\
哇！叔叔！\n\
叔叔！\n\
好吧，我给！\n\
拿着这颗星！\n\
哦！\n\
我感觉好多了，\n\
不再需要它了。\n\
如果在晚上，我\n\
可以透过天花板\n\
看见许多星星。\n\
它们使我感到…\n\
平静。任何时候\n\
都欢迎你回来看\n\
看我。"))

DEFINE_DIALOG(DIALOG_153, 1, 4, 30, 200, _("\
嗨！谁在那儿？\n\
什么东西在我身\n\
上爬啊！\n\
难道是冰蚂蚁？\n\
还是雪跳蚤？\n\
不管这么多了，\n\
无论是什么，把\n\
我惹烦了！我想\n\
我要把它吹走！"))

DEFINE_DIALOG(DIALOG_154, 1, 5, 30, 200, _("\
抓紧你的帽子！\n\
如果丢了它，你\n\
会很容易受伤\n\
噢。万一不小心\n\
丢失了帽子，一\n\
定要马上回头去\n\
寻找啊！\n\
公主可还被困在\n\
墙壁中的某处。\n\
快，快去找啊，\n\
马力欧！\n\
　\n\
噢，你知道在墙\n\
里和壁画中都隐\n\
藏着秘密世界，\n\
是吧？"))

DEFINE_DIALOG(DIALOG_155, 1, 6, 30, 200, _("\
谢谢力量之星的\n\
能量，城堡里又\n\
出现了生机。\n\
快，马力欧，是\n\
时候教训酷霸王\n\
了！\n\
　\n\
这里，让我告诉\n\
你一些关于城堡\n\
的事吧。在那个\n\
有镜子的房间，\n\
一定要仔细注意\n\
没有被镜子反射\n\
到的物品。还有\n\
当你要去水城的\n\
时候，你可以高\n\
高跃起进入壁\n\
画。"))

DEFINE_DIALOG(DIALOG_156, 1, 5, 30, 200, _("\
那个钟里的世界\n\
太奇怪了，注意\n\
那个大指针的位\n\
置。"))

DEFINE_DIALOG(DIALOG_157, 1, 5, 30, 200, _("\
当心！千万不要\n\
被流沙吞没了。\n\
　\n\
如果你陷入沙\n\
中，就不能起跳\n\
了。流沙没过你\n\
的头，你就会被\n\
闷死。\n\
　\n\
黑暗地区可是一\n\
个无底的深渊！"))

DEFINE_DIALOG(DIALOG_158, 1, 6, 30, 200, _("\
１　如果你做连\n\
续的跳跃，而且\n\
按键时间合适的\n\
话，你会越跳越\n\
高。如果你正在\n\
快跑时做连续跳\n\
跃，而且按键时\n\
间合适的话，你\n\
就可以做一个三\n\
级跳远了。\n\
　\n\
２　先往墙壁上\n\
跳，在碰到墙壁\n\
时，再次起跳，\n\
你就可以来一个\n\
踢墙跳，用它可\n\
以反弹到更高的\n\
地方。"))

DEFINE_DIALOG(DIALOG_159, 1, 6, 30, 200, _("\
如果你先站立不\n\
动，按[Z]键下\n\
蹲，然后起跳，\n\
就可来一个后空\n\
翻。要来一个远\n\
跳，先跑起来，\n\
按下[Z]键，再起\n\
跳。"))

DEFINE_DIALOG(DIALOG_160, 1, 4, 30, 200, _("\
要使用身体滑行\n\
攻击，在快跑中\n\
按下[B]键。要想\n\
在滑行中站住，\n\
按[A]或者[B]键。"))

DEFINE_DIALOG(DIALOG_161, 1, 4, 30, 200, _("\
　\n\
马力欧！！！\n\
那真的是你吗？\n\
从上一次冒险到\n\
现在，我们都没\n\
有见过面啊！他\n\
们告诉我，如果\n\
我等在这里就有\n\
可能见到你，不\n\
过，我真的准备\n\
要放弃了！\n\
　\n\
天啊？你真的击\n\
败了酷霸王吗？\n\
而且你夺回了所\n\
有的力量之星，\n\
救出了公主？\n\
　\n\
我就知道你一定\n\
能行的！\n\
　\n\
现在我要告诉你\n\
一个非常特别的\n\
消息。\n\
　\n\
十分感谢你玩\n\
神游马力欧！虽\n\
然游戏结束了，\n\
但是欢乐还没有\n\
结束。下面是我\n\
们为你准备的大\n\
礼物，希望你能\n\
够喜欢！\n\
　\n\
　\n\
神游马力欧小组"))

DEFINE_DIALOG(DIALOG_162, 1, 4, 30, 200, _("\
不，不，不！怎\n\
么又是你！你有\n\
没有看见，我现\n\
在真的很忙？\n\
　\n\
我真的没有时间\n\
跟你争论什么关\n\
于星星的事。\n\
　\n\
这个，拿去吧，\n\
我现在要马上走\n\
了。让我走吧！"))

DEFINE_DIALOG(DIALOG_163, 1, 5, 30, 200, _("\
　\n\
不…！你这次真\n\
的把我给打败\n\
了，马力欧！我\n\
真的不能容忍我\n\
竟然输给你了。\n\
　\n\
我的部队真是群\n\
废物！他们已经\n\
交出了所有的力\n\
量之星！什么？\n\
有１２０颗？\n\
　\n\
真是不可思议，\n\
啊！有一些我也\n\
无法找到？？！\n\
！！！\n\
　\n\
现在，我看到世\n\
界终于重归和平\n\
了…噢！我好恨\n\
和平啊！我不想\n\
看到这个，我要\n\
离开这儿！\n\
　\n\
你等着，我会回\n\
来的。到那时，\n\
要让你的摇杆冒\n\
烟！\n\
　\n\
哇哈哈哈哈！"))

DEFINE_DIALOG(DIALOG_164, 1, 4, 30, 200, _("\
马力欧！你怎么\n\
了？我已经很久\n\
没有上滑道了，\n\
都快不成样子\n\
了。\n\
　\n\
我一直在期待和\n\
一位滑雪老手来\n\
进行一场精彩的\n\
比赛。\n\
　\n\
你想和我比吗？\n\
　\n\
预备…\n\
　\n\
　　开始！　　不"))

DEFINE_DIALOG(DIALOG_165, 1, 5, 30, 200, _("\
我对那些由于绕\n\
着柱子跑而昏倒\n\
的人决不承担任\n\
何责任。"))

DEFINE_DIALOG(DIALOG_166, 1, 4, 30, 200, _("\
我外出训练去\n\
了，会很快回来\n\
的。\n\
　\n\
你以后再来吧。\n\
　\n\
——喏库喏库"))

DEFINE_DIALOG(DIALOG_167, 1, 4, 30, 200, _("\
公主的城堡就在\n\
前面。\n\
　\n\
按[A]键跳跃，按\n\
[Z]键蹲下，按[B]\n\
键出拳、读标记\n\
或者抓起东西。\n\
再按[B]键扔掉你\n\
刚刚抓起的东\n\
西。"))

DEFINE_DIALOG(DIALOG_168, 1, 5, 30, 200, _("\
嗨！撞掉它！这\n\
已经是你第二次\n\
抓住我了。现\n\
在，你是在找它\n\
吧，马力欧！"))

DEFINE_DIALOG(DIALOG_169, 1, 4, 30, 200, _("\
不准进来！\n\
就是说你！\n\
哇哈哈哈！\n\
　\n\
任何私自进洞的\n\
人，一定会遇到\n\
灾难的。\n\
　\n\
——船长"))
