COURSE_ACTS(COURSE_BOB, _(" 1 ボムへいの せんじょう"),
       _("やまのうえの ボムキング")                  , _("はくねつ ノコノコレ-ス")                  , _("そらのしままで ぶっとべ"),
       _("8まいの あかコイン")                    , _("そらにはばたけ はねマリオ")                 , _("ワンワンの いぬごやで"))

COURSE_ACTS(COURSE_WF, _(" 2 バッタンキングの とりで"),
       _("いかりのバッタン キング")                  , _("とりでの てっぺんへ")                    , _("たいほうで ひとっとび"),
       _("うきしまの 8まいコイン")                  , _("とりかごへ スト-ン")                    , _("たいほうで ぶっこわせ!"))

COURSE_ACTS(COURSE_JRB, _(" 3 かいぞくの いりえ"),
       _("ちんぼつせんの おたから")                  , _("でてこい きょだいウツボ")                  , _("かいていどうくつの おたから"),
       _("うかんだフネの あかコイン")                 , _("いわのはしらへ ひとっとび")                 , _("ふきだす みずを くぐれ"))

COURSE_ACTS(COURSE_CCM, _(" 4 さむいさむい マウンテン"),
       _("ス-パ-スノ-スライダ-")                  , _("まいごの こペンギン")                    , _("ペンギン チャンピオンレ-ス"),
       _("すべって 8まいあかコイン")                 , _("ゴロゴロ ゆきダルマ")                    , _("かくれ ス-パ- カベキック"))

COURSE_ACTS(COURSE_BBH, _(" 5 テレサの ホラ-ハウス"),
       _("おやかたテレサを さがせ")                  , _("テレサの メリ-ゴ-ランド")                 , _("ほんだなオバケの ナゾ"),
       _("8まいコインは どこだ")                   , _("バルコニ-の ボステレサ")                  , _("かくしべやの おおめだま"))

COURSE_ACTS(COURSE_HMC, _(" 6 やみにとける どうくつ"),
       _("ドッシ-のいる ちていこ")                  , _("そうさリフトの あかコイン")                 , _("メタルで ダッシュ"),
       _("ケムリめいろを ぬけて")                   , _("ケムリめいろの ひじょうぐち")                , _("ゴロゴロいわの ひみつ"))

COURSE_ACTS(COURSE_LLL, _(" 7 ファイアバブル ランド"),
       _("おとせ ボスどんけつ")                    , _("たたかえ!どんけつたい")                   , _("15パズルの 8まいコイン"),
       _("コロコロ まるたわたり")                   , _("かざんの パワ-スタ-")                   , _("かざんの リフトツア-"))

COURSE_ACTS(COURSE_SSL, _(" 8 あっちっち さばく"),
       _("いたずらハゲたか ジャンゴ")                 , _("ピラミッドの てっぺんで")                  , _("きょだいピラミッドの ないぶ"),
       _("4つのはしらに たつものへ")                 , _("とびまわれ 8まいコイン")                  , _("きょだいピラミッドのナゾ"))

COURSE_ACTS(COURSE_DDD, _(" 9 ウォ-タ- ランド"),
       _("クッパの せんすいかん")                   , _("うずしおの たからばこ")                   , _("にげたクッパの あかコイン"),
       _("ふきだす みずを くぐれ")                  , _("マンタの おくりもの")                    , _("ボウシが そろったら"))

COURSE_ACTS(COURSE_SL, _("10 スノ-マンズ ランド"),
       _("おおゆきダルマの おでこ")                  , _("こおりのくにの どんけつ")                  , _("こおりの オブジェ"),
       _("つめたい いけを こえて")                  , _("コウラにのって あかコイン")                 , _("フワフワさんの おうち"))

COURSE_ACTS(COURSE_WDW, _("11 みずびたシティ-"),
       _("ビリビリの まめリフト")                   , _("トップオブ ザ シティ-")                  , _("あさせと そらのシ-クレット"),
       _("いそげ!かなあみエレベ-タ-")                , _("ダウンタウンの あかコイン")                 , _("ダウンタウンを かけろ"))

COURSE_ACTS(COURSE_TTM, _("12 たかいたかいマウンテン"),
       _("たかいたかい やまのうえ")                  , _("いたずらザル ウッキィのオリ")                , _("おばけキノコの あかコイン"),
       _("マウンテン スライダ-")                   , _("はしのうえから みわたせば")                 , _("ぶっとべ はなれキノコへ"))

COURSE_ACTS(COURSE_THI, _("13 ちびでか アイランド"),
       _("きょだいパックンフラワ-")                  , _("デカじまの てっぺんで")                   , _("ノコノコ リタ-ンマッチ"),
       _("チビじまの 5シ-クレット")                 , _("ハナチャンの あかコイン")                  , _("イカリの ハナチャン"))

COURSE_ACTS(COURSE_TTC, _("14 チックタックロック"),
       _("グルグル かごのなかへ")                   , _("ふりこの へや")                       , _("チックタックはりの うえ"),
       _("えっへん てっぺん ドッスン")                , _("つきだしを のりこえて")                   , _("00ふんの あかコイン"))

COURSE_ACTS(COURSE_RR, _("15 レインボ- クル-ズ"),
       _("にじを わたる ふね")                    , _("てんくうの おやしき")                    , _("タテめいろの あかコイン"),
       _("カゼきる きょだいブランコ")                 , _("おおぞら アスレチック")                   , _("にじの かなたの しま"))

SECRET_STAR(COURSE_BITDW, _("   やみの せかいの クッパ"))
SECRET_STAR(COURSE_BITFS, _("   ほのおの うみの クッパ"))
SECRET_STAR(COURSE_BITS, _("   てんくうの たたかい!"))
SECRET_STAR(COURSE_PSS, _("   ピ-チのかくれスライダ-"))
SECRET_STAR(COURSE_COTMC, _("   メタルスイッチの たき"))
SECRET_STAR(COURSE_TOTWC, _("   はばたけ!はねスイッチへ"))
SECRET_STAR(COURSE_VCUTM, _("   おほりのとうめいスイッチ"))
SECRET_STAR(COURSE_WMOTR, _("   にじ かける はねマリオ"))
SECRET_STAR(COURSE_SA, _("   おさかなと いっしょ"))
SECRET_STAR(COURSE_CAKE_END, _("   おいしいケ-キ"))

CASTLE_SECRET_STARS(_("   おしろのかくれスタ-"))

EXTRA_TEXT(0, _("おしろのかくれスタ-"))
EXTRA_TEXT(1, _("100まいコインの スタ-"))
EXTRA_TEXT(2, _("マウンテンのへやが ひらく!"))
EXTRA_TEXT(3, _("みずとゆき2つのへやが ひらく!"))
EXTRA_TEXT(4, _("おおきなほしの ドアがひらく!"))
EXTRA_TEXT(5, _("クッパへの とびらがひらく!"))
EXTRA_TEXT(6, _("3がいへの とびらがひらく!"))
