// Parameters: dialog enum ID, (unused), lines per box, left offset, width

DEFINE_DIALOG(DIALOG_000, 1, 5, 30, 200, _("\
おおっと,ここはキケンな\n\
せんじょうの どまんなか。\n\
『え』のなかのせかいには\n\
クッパが ぬすんだ\n\
パワ-スタ-がある。\n\
まずは,あかいボムへいに\n\
はなしかけてみるといい!\n\
Bボタンではなしができる。\n\
きっと,ちからになって\n\
くれるはずだ。\n\
カンバンを よむときも\n\
たちどまって Bボタン!\n\
AかBボタンですすめる!\n\
まえにたつだけで はなし\n\
かける,どうぶつもいます。"))

DEFINE_DIALOG(DIALOG_001, 1, 4, 95, 200, _("\
あぶない あぶない!!\n\
こんなところを うろうろ\n\
してると,みずばくだんが\n\
ふってきますよ。\n\
くろいボムへいたちは\n\
たたかいが だいすきで,\n\
いつも ぼくらを\n\
こうげきしてきます。\n\
ボムキングという ボスが\n\
スタ-を てにいれてから\n\
ここは せんじょうに\n\
なってしまいました。\n\
ボムキングから スタ-を\n\
とりあげてくれませんか?\n\
このさきの はしをわたり\n\
みちぞいにひだりにいけば,\n\
ボムとりでの いりぐちに\n\
つきます。キングのスタ-\n\
を とりもどしたら また\n\
あいに きてください。"))

DEFINE_DIALOG(DIALOG_002, 1, 4, 95, 200, _("\
ちょっと あなた!\n\
このさきはキケンですよ!\n\
\n\
そこで,アドバイスです。\n\
そらから ふってくる\n\
みずばくだんをよけて,\n\
はしを『2つ』わたると\n\
あちらの『じんち』です。\n\
やまのうえのボムキングは\n\
すごく ちからもちです。\n\
かつぎあげられないように\n\
きをつけてください。\n\
ぼくら あかボムへいは\n\
あなたのみかたです。\n\
いつでも はなしかけて\n\
きてくださいね!"))

DEFINE_DIALOG(DIALOG_003, 1, 5, 95, 200, _("\
おかげで ボムキングは\n\
おとなしくなりました!\n\
でも,たたかいは おわり\n\
ません。 かいぶつたちが\n\
まだスタ-をもっています。\n\
スタ-をいくつかとったら\n\
あたらしい へやのドアを\n\
ひらくことが できます。\n\
つぎのへやの せかいへと\n\
すすんでください!\n\
ぼくらのなかまが\n\
おまちしています。\n\
はなしかけて くださいね。\n\
いつでも たいほうを\n\
じゅんびしますよ。"))

DEFINE_DIALOG(DIALOG_004, 1, 3, 95, 200, _("\
ぼくたちは へいわを\n\
ねがっています。 だから\n\
たいほうは つかいません。\n\
けれど あなたをどこかに\n\
とばすなら へいきです。\n\
どうぞ つかってください。\n\
このコ-スにあるすべての\n\
あかボムぐん たいほうを\n\
つかえるように します。"))

DEFINE_DIALOG(DIALOG_005, 1, 4, 30, 200, _("\
な-んだ,マリオさんじゃ\n\
ないッスか!\n\
ボムキングやっつけたって\n\
ほんと-ッスか?\n\
いや- すごいッス!\n\
さっすが つよいし,\n\
オイラほどではないけど,\n\
あしも はやいッスよね!\n\
ひとつオイラと,\n\
ボムキングのヤツがいた\n\
おやまのちょうじょうまで\n\
かけっこでもしませんか?\n\
それでは オイラが,\n\
『ドン!』といったら\n\
スタ-ト ッスよ。\n\
\n\
 ヨ---イ!\n\
\n\
   ドン!  やめる"))

DEFINE_DIALOG(DIALOG_006, 1, 4, 30, 200, _("\
ははっ ズルッコは\n\
なしッス! マリオさん。\n\
またこんど\n\
あそびましょうね。"))

DEFINE_DIALOG(DIALOG_007, 1, 6, 30, 200, _("\
ハア ハア ハア\n\
いや-まいったッス!\n\
ほんと はえ-ッスね!\n\
オイラに かったきねんに,\n\
これ,あげるッス。\n\
ホイ!"))

DEFINE_DIALOG(DIALOG_008, 1, 5, 30, 200, _("\
もうけんワンワン キケン\n\
Cボタンの うえをおして\n\
『マリオのちかく』から\n\
ながめて ください。\n\
とても コワイです。\n\
クイのうえの あかコイン。\n\
おなじコインを さがして\n\
8まいあつめると,はしを\n\
わたったひだりのはやしに\n\
スタ-がでます。"))

DEFINE_DIALOG(DIALOG_009, 1, 5, 30, 200, _("\
ひっさしぶりッス! いま\n\
ちょ-どかえったとこッス。\n\
パワ-スタ-のせいか\n\
いちだんと はやくなった\n\
ようッスね!\n\
このまえは まけちゃって\n\
ほ-んと くやしいッス。\n\
ここは オイラのホ-ム\n\
グランド!じしんあるッス。\n\
もいちどやりましょうよ!\n\
ゴ-ルはカゼふきのたに!\n\
しってるッスよね!?\n\
そんじゃ\n\
 ヨ---イ!\n\
   ドン!  やめる"))

DEFINE_DIALOG(DIALOG_010, 1, 3, 30, 200, _("\
そらを じゆうにとべる\n\
『はねのぼうし』の\n\
スイッチを ふみました。\n\
せかいじゅうにある\n\
あかブロックから,はねの\n\
ぼうしがとびだします。\n\
ここまでをセ-ブする?\n\
\n\
   はい   いいえ"))

DEFINE_DIALOG(DIALOG_011, 1, 3, 30, 200, _("\
むてきの からだになれる\n\
『メタルのぼうし』の\n\
スイッチを ふみました。\n\
せかいじゅうの みどりの\n\
ブロックから,メタルの\n\
ぼうしが とびだします。\n\
ここまでをセ-ブする?\n\
\n\
   はい   いいえ"))

DEFINE_DIALOG(DIALOG_012, 1, 3, 30, 200, _("\
すがたをけせる まほうの\n\
『とうめいのぼうし』の\n\
スイッチを ふみました。\n\
せかいじゅうの あおい\n\
ブロックから,とうめい\n\
ぼうしが とびだします。\n\
ここまでをセ-ブする?\n\
\n\
   はい   いいえ"))

DEFINE_DIALOG(DIALOG_013, 1, 5, 30, 200, _("\
100まいコインの\n\
スタ-を てにいれた!\n\
おしろのパワ-が\n\
またひとつマリオに\n\
  ちからを あたえた。\n\
\n\
ここまでセ-ブしますか?\n\
\n\
   はい   いいえ"))

DEFINE_DIALOG(DIALOG_014, 1, 5, 30, 200, _("\
おもわぬところで\n\
スタ-をてにいれた。\n\
そして おしろのパワ-が\n\
またひとつ マリオに\n\
  ゆうきを あたえた。\n\
\n\
ここまでセ-ブしますか?\n\
\n\
   はい   いいえ"))

DEFINE_DIALOG(DIALOG_015, 1, 4, 30, 200, _("\
てきはパンチでたおせるよ。\n\
Aボタンは『ジャンプ』\n\
Bボタンは『パンチ』です。\n\
AとBボタンで『キック』。\n\
『ものをもつ』ときも\n\
       Bボタン!\n\
『なげる』は もういちど\n\
Bボタンをおしてください。"))

DEFINE_DIALOG(DIALOG_016, 1, 4, 30, 200, _("\
キラキラひかったコウラに\n\
のると,どんなところも\n\
スイスイすすめる!\n\
てきをけちらし すすめ!"))

DEFINE_DIALOG(DIALOG_017, 1, 4, 30, 200, _("\
ワシがボムキング,つまり\n\
ばくだんの おうさまだ。\n\
よくここまできた。その\n\
ゆうきは ほめてやろう。\n\
とはいえ,おまえにタダで\n\
だいじな パワ-スタ-を\n\
やるわけには いかん。\n\
そこで チャンスをやろう。\n\
パワ-スタ-がほしければ\n\
ワシを なげとばしてみろ。\n\
うしろから かつげるか?\n\
さあ,かかってこい!"))

DEFINE_DIALOG(DIALOG_018, 1, 4, 30, 200, _("\
ねむいので,ねています。\n\
おこすと おこります。\n\
\n\
しずかに あるきましょう。"))

DEFINE_DIALOG(DIALOG_019, 1, 2, 30, 200, _("\
ろうかは しずかに\n\
あるきましょう。"))

DEFINE_DIALOG(DIALOG_020, 1, 5, 95, 150, _("\
おしろへ あそびに\n\
きてください。\n\
ケ-キを つくって\n\
まってます。\n\
     -ピ-チより-"))

DEFINE_DIALOG(DIALOG_021, 1, 5, 95, 200, _("\
ようこそいらっしゃいませ\n\
・・だれも いませんので\n\
とっとと\n\
  おかえりください。\n\
ガハハハッ!"))

DEFINE_DIALOG(DIALOG_022, 1, 3, 95, 200, _("\
カギが かかっている・・"))

DEFINE_DIALOG(DIALOG_023, 1, 3, 95, 200, _("\
・・・カギがあわない!\n\
このカギは『ちか』への\n\
カギのようだ。"))

DEFINE_DIALOG(DIALOG_024, 1, 3, 95, 200, _("\
クッパがとじたこのドアを\n\
ひらくには,スタ-の\n\
パワ-が ひつようです。\n\
どこかのへやの『え』の\n\
なかの モンスタ-から\n\
とりもどしてきてください"))

DEFINE_DIALOG(DIALOG_025, 1, 3, 95, 200, _("\
このドアを ひらくには\n\
スタ-3まいの パワ-が\n\
ひつようです。\n\
あと[%]まいの スタ-が\n\
ひつようです。"))

DEFINE_DIALOG(DIALOG_026, 1, 3, 95, 200, _("\
このドアを ひらくには\n\
スタ-8まいの パワ-が\n\
ひつようです。\n\
あと[%]まいの スタ-が\n\
ひつようです。"))

DEFINE_DIALOG(DIALOG_027, 1, 3, 95, 200, _("\
このドアを ひらくには\n\
スタ-30まいのパワ-が\n\
ひつようです。\n\
スタ-があと\n\
[%]まいひつようです。"))

DEFINE_DIALOG(DIALOG_028, 1, 3, 95, 200, _("\
このドアを ひらくには\n\
スタ-50まいのパワ-が\n\
ひつようです。\n\
あと[%]まいの スタ-が\n\
ひつようです。"))

DEFINE_DIALOG(DIALOG_029, 1, 4, 95, 200, _("\
はてしない かいだんの\n\
ドアを ひらくには\n\
スタ-70まいのパワ-が\n\
ひつようです・・・・・\n\
あと[%]まいの スタ-が\n\
たりません・・・\n\
ガハハッ!"))

DEFINE_DIALOG(DIALOG_030, 1, 4, 30, 200, _("\
カメラマンのジュゲムです。\n\
ちょっと アドバイス!\n\
しずかにあるきたいときは\n\
ゆっくり あるくことです。\n\
まわりを みたいときは\n\
Cボタンのみぎとひだりで\n\
カメラをすこしまわせます。\n\
Cのしたで とおくから。\n\
できないところでは\n\
『ブ-ッ!』といいます。\n\
よろしく!! \n\
      -ジュゲム"))

DEFINE_DIALOG(DIALOG_031, 1, 3, 30, 200, _("\
またまた まけちゃったよ。\n\
こんどはスッゴい じしん\n\
あったんッスけどね・・・\n\
ほんと すごいッスね!\n\
このスタ-も\n\
あげちゃいます!"))

DEFINE_DIALOG(DIALOG_032, 1, 4, 30, 200, _("\
はねぼうしの あるひとは\n\
3かいれんぞくでジャンプ\n\
しよう。 おおぞらたかく\n\
とびあがれます。\n\
たいほうでとぶと\n\
さらに たかくとべます。\n\
まわりをみるのはCボタン。\n\
おりたいときはZボタン。"))

DEFINE_DIALOG(DIALOG_033, 1, 4, 30, 200, _("\
ワ-プどかんを\n\
くぐりぬけ,\n\
ピ-チの おしろに\n\
つきました。\n\
そうさは カンタン。\n\
Aボタンが ジャンプ!\n\
Bボタンで こうげき!\n\
カンバンも よめます。\n\
マリオを うごかすのは\n\
まんなかに ついてる\n\
『3Dスティック』。\n\
まずはおしろへ すすめ!"))

DEFINE_DIALOG(DIALOG_034, 1, 5, 30, 200, _("\
こんにちは! \n\
ぼくたちカメラマンの\n\
ジュゲムブラザ-ズです。\n\
これから,カメラをもって\n\
あなたに ついていきます。\n\
カメラは おすすめのいち\n\
から さつえいしてます。\n\
むきをかえるのはCボタン,\n\
かえられない ときは\n\
『ブ-ッ!』といいます。\n\
ちょっと たちどまったら\n\
Cボタンのうえ!\n\
まわりを ながめられます。\n\
ゲ-ムに もどすときは\n\
『Aボタン』です。\n\
『Rボタン』をつかうと\n\
いろんなカメラモ-ドに\n\
きりかえられます。\n\
また,かんばんなどをみて\n\
おぼえてください!\n\
いじょう!! カメラマン\n\
ジュゲムブラザ-ズからの\n\
おしらせでした。\n\
それじゃ,きをつけて!"))

DEFINE_DIALOG(DIALOG_035, 1, 4, 30, 200, _("\
きいろい4つの Cボタン。\n\
『うえ』をおすと\n\
3Dスティックで\n\
まわりを みわたせます。\n\
ふだんマリオをみてるのは\n\
おすすめのジュゲムカメラ。\n\
Cボタンで すこし,\n\
かくどが かえられます。\n\
Rボタンをおすと\n\
マリオの うしろからみる\n\
マリオカメラに なります。\n\
もどすときはもういちどR。\n\
『ジュゲムカメラ』と\n\
『マリオカメラ』どちらも\n\
Cボタンの したをおすと,\n\
とおくへ はなれます。\n\
いまつかっている\n\
カメラを しりたいときは,\n\
がめん みぎしたの\n\
アイコンを みてください。"))

DEFINE_DIALOG(DIALOG_036, 1, 5, 30, 200, _("\
 『てんぼうだい』\n\
Cボタンの うえをおすと,\n\
まわりを みわたせます。\n\
みえないところは よ-く\n\
たしかめてからすすめ-!\n\
Rボタンはマリオのカメラ。\n\
いつも マリオのうしろを\n\
ついていくぞ。ジュゲムに\n\
もどすときは もういちど\n\
Rボタンをおすこと。\n\
ポ-ズがめんで モ-ドを\n\
かえると,Rボタンを\n\
おしてるあいだ カメラを\n\
『とめる』こともできる!\n\
ためしてみよう。\n\
つかってるカメラモ-ドは\n\
みぎしたのアイコンで\n\
たしかめよう。\n\
マリオとの きょりは\n\
きいろやじるしを みよう。"))

DEFINE_DIALOG(DIALOG_037, 1, 3, 30, 200, _("\
あたしの『かち』です。\n\
あなたの『まけ』です。\n\
ははははは!!!\n\
マリオさん,と-っても\n\
おしかったですね。\n\
また あそびましょう!"))

DEFINE_DIALOG(DIALOG_038, 1, 3, 95, 200, _("\
パワ-スタ-の ちからで\n\
つぎの せかいへのドアは\n\
しずかにひらいた。"))

DEFINE_DIALOG(DIALOG_039, 1, 5, 30, 200, _("\
-ボムとりで いりぐち-\n\
  だれも はいるな!\n\
\n\
ワシのパワ-スタ-は\n\
だれにも わたさぬ。\n\
クッパどのからいただいた\n\
だいじな だいじな\n\
たからものだ。\n\
なんまいか かくしたが\n\
ばしょは おしえぬ。\n\
コ-スはじめの スタ-の\n\
なまえを,ヒントにする\n\
ぐらいなら ゆるす。\n\
\n\
おやまのうえのボムキング"))

DEFINE_DIALOG(DIALOG_040, 1, 3, 30, 200, _("\
このさき キケン!\n\
リフトのたにぞこ です。"))

DEFINE_DIALOG(DIALOG_041, 1, 4, 30, 200, _("\
オイラがかっちゃいました。\n\
ハッハッハッ\n\
たいしたことないッスね!\n\
じゃ,またこんどね!"))

DEFINE_DIALOG(DIALOG_042, 1, 5, 30, 200, _("\
この『はし』せまい。\n\
ゆっくりわたろう!\n\
ガケのカドにとびついたり\n\
ゆっくりと おりると\n\
ぶらさがれます。\n\
『て』を はなすときは\n\
Zボタンか スティックを\n\
マリオのうしろへ。\n\
のぼるときには まえへ\n\
たおしてください。\n\
ぶらさがって すぐに\n\
Aボタンをおすと\n\
すばやく あがれます。"))

DEFINE_DIALOG(DIALOG_043, 1, 4, 30, 200, _("\
ジャンプしてAボタンを\n\
おしっぱなしに すると\n\
ぶらさがれる ところが\n\
あります。\n\
『とり』につかまるとき\n\
と おなじです。"))

DEFINE_DIALOG(DIALOG_044, 1, 5, 95, 200, _("\
だれだい!  せっかく\n\
いいきもちで ねてたのに。\n\
あ- カラダがおもいな-\n\
ちょ-どいいや!わたしと\n\
ひと-っとび しません?\n\
ジャンプボタンを\n\
おしているあいだ\n\
ぶらさがれますよ-。\n\
おりたいときに\n\
はなせばい-です。\n\
お-すきなところへ\n\
おつれしま-す。\n\
かげを よ-くみて\n\
Aボタンで つかまって\n\
くださいね-!"))

DEFINE_DIALOG(DIALOG_045, 1, 5, 95, 200, _("\
あ-あ,つかれた-・・\n\
や-っぱり おもいな-。\n\
きょうは このあたりで!\n\
『もういちどAボタンを\n\
おしなおしてください。』\n\
もうすこし とんだら\n\
ほんとに てをはなしてね\n\
\n\
じゃあ,さよなら-!"))

DEFINE_DIALOG(DIALOG_046, 1, 5, 30, 200, _("\
ジャンプのワザ まとめて\n\
せいりしておきます。\n\
とてもだいじな3つのワザ。\n\
おぼえて つかって\n\
みてください。\n\
タイミングよく つづけて\n\
とぶと たかくとべます。\n\
はやく はしっていると\n\
さらに たかくとべます。\n\
『3だんとび』です。\n\
はしりながら Zボタンで\n\
しゃがんでジャンプすると\n\
とおくへ とべます。\n\
『はばとび』です。\n\
とてもべんりです。\n\
まっすぐたった カベに\n\
むかって ジャンプして,\n\
ぶつかった ところから\n\
また ジャンプできます。\n\
『カベキック』といいます。\n\
だいじな テクニック\n\
『3だんとび』\n\
『はばとび』\n\
『カベキック』\n\
     わかった?"))

DEFINE_DIALOG(DIALOG_047, 1, 3, 95, 200, _("\
こんにちは!\n\
たいほうの じゅんびに\n\
かかります!・・・・・"))

DEFINE_DIALOG(DIALOG_048, 1, 4, 30, 200, _("\
ここは ツルツルすべる\n\
ゆきやまの ちょうじょう。\n\
まずはそこの\n\
やまごやへ どうぞ。"))

DEFINE_DIALOG(DIALOG_049, 1, 5, 30, 200, _("\
ジャンプわざカベキックを\n\
おぼえていますか?\n\
たかいところへ あがる\n\
とてもだいじなテクニック。\n\
カベからカベへジャンプ!\n\
スティックをつかって\n\
はねかえったほうに\n\
かそくする。\n\
よ-く\n\
れんしゅう しておこう!"))

DEFINE_DIALOG(DIALOG_050, 1, 4, 30, 200, _("\
Zボタンで しゃがめます。\n\
『さか』では すべれます。\n\
ジャンプの とちゅうなら\n\
『ヒップドロップ』!!\n\
とまって しゃがんでから\n\
ジャンプすると\n\
『バックちゅう』できる!\n\
わかった? まだあります。\n\
はしりながら しゃがんで\n\
ジャンプで『はばとび』!\n\
しゃがんでから あるくと\n\
・・・ひみつです。"))

DEFINE_DIALOG(DIALOG_051, 1, 5, 30, 200, _("\
『き』や『ぼう』には\n\
ジャンプで つかまれます。\n\
『のぼる』『おりる』は\n\
スティックで,やめるのは\n\
Zボタンで『て』をはなす。\n\
『むきをかえる』ときは\n\
 3Dスティックの\n\
   みぎ と ひだり。\n\
Aボタンで『せなか』の\n\
ほうこうにジャンプします。\n\
テッペンで もういちど\n\
スティックを うえにいれ,\n\
『さかだち』ができる。\n\
むきをきめて せなかの\n\
ほうこうに ジャンプだ!"))

DEFINE_DIALOG(DIALOG_052, 1, 4, 30, 200, _("\
Zボタンで しゃがめます。\n\
とまって しゃがんでから\n\
ジャンプすると,\n\
『バックちゅう』できる!\n\
すばやくユ-タ-ンを\n\
しながら,ジャンプすると\n\
『ちゅうがえり』!\n\
どちらも たかくとべます。"))

DEFINE_DIALOG(DIALOG_053, 1, 6, 30, 200, _("\
コインリングや かくれた\n\
シ-クレットポイントを\n\
とおると あかいすうじが\n\
でてきます。5こつづけて\n\
とおると ひみつのスタ-\n\
が あらわれます。"))

DEFINE_DIALOG(DIALOG_054, 1, 4, 30, 200, _("\
スライダ-へようこそ!!\n\
さかを すべりはじめたら\n\
スティックまえで かそく,\n\
うしろで げんそくできる。"))

DEFINE_DIALOG(DIALOG_055, 1, 5, 30, 200, _("\
あたし,このスライダ-の\n\
せかいチャンピオン!!!\n\
からだ,デカイけど\n\
とっても はやいよ!\n\
あなたチャレンジします?\n\
それでは!\n\
\n\
 レディ---・・・!\n\
  ・・・ \n\
   ゴ-!! やめとく"))

DEFINE_DIALOG(DIALOG_056, 1, 3, 30, 200, _("\
ヒエ---ッ!!!\n\
セカイきろくだよ!\n\
スゴイよ!あなた!!\n\
きんメダルの かわりに\n\
コレ あげます!\n\
いや--スゴイスゴイ!!"))

DEFINE_DIALOG(DIALOG_057, 1, 4, 30, 200, _("\
どこかで うちのこどもを\n\
みかけません でしたか?\n\
・・・わたしんち こども\n\
いっぱい いましてね・・\n\
なんびき いたのかも\n\
おぼえてなくて・・・・\n\
ほんとに・・\n\
どこへ いったんでしょう。\n\
だいてやると\n\
とても いいこえで\n\
なくんですけどね・・・\n\
ヤレヤレ・・・・・"))

DEFINE_DIALOG(DIALOG_058, 1, 5, 30, 200, _("\
ああ--っ!!たしかに\n\
うちの こどもです・・・\n\
『こらっ! いつも\n\
ちかくで あそびなさいと\n\
いってるだろ!』\n\
あなた とっても\n\
いいひとです。 おれいに\n\
これを さしあげます。\n\
あったかくって とても\n\
げんきに なりますよ。"))

DEFINE_DIALOG(DIALOG_059, 1, 5, 30, 200, _("\
このこは うちのこじゃ-\n\
ないようだなあ・・・\n\
かわいそうに・・・\n\
おやはいったい\n\
なにをしてるんだろう・・"))

DEFINE_DIALOG(DIALOG_060, 1, 4, 30, 200, _("\
-みずにはいるちゅうい-\n\
\n\
もぐっていると しぬほど\n\
くるしくなってきます。\n\
すいめんに あがるか\n\
アブクをみつけて\n\
さわってください。\n\
ひといき つけます。\n\
およぐときは Aボタン!\n\
おしてるだけでも すすみ\n\
タイミングよく おすと\n\
スピ-ドがでます。\n\
もぐるときはスティックを\n\
まえにたおして Aボタン。\n\
うかぶときはスティックを\n\
てまえにひいて Aボタン。\n\
すいめんに いるときは\n\
ジャンプします。\n\
 『じゅんびたいそう\n\
    わすれずに!!』"))

DEFINE_DIALOG(DIALOG_061, 1, 6, 30, 200, _("\
つめたいみず キケン!!\n\
およいでは いけません!\n\
この こおりのいけは\n\
とびあがるぐらい\n\
つめたいです!\n\
        ペンギン"))

DEFINE_DIALOG(DIALOG_062, 1, 5, 30, 200, _("\
みどりの ブロックに\n\
かくされている\n\
ふしぎな ふしぎな\n\
『メタルのぼうし』。\n\
\n\
ひをつけたってもえないし\n\
てきのたまも はねかえす。\n\
いきを とめても\n\
へいきです。\n\
こまったことにおよげない。"))

DEFINE_DIALOG(DIALOG_063, 1, 4, 30, 200, _("\
あおいブロックには\n\
『とうめいぼうし』。\n\
メダマも ビックリ\n\
すがたをけせる。\n\
テレサも まっさお\n\
『ひみつのカベ』を\n\
とおりぬけるぞ。"))

DEFINE_DIALOG(DIALOG_064, 1, 4, 30, 200, _("\
あかいブロックのなかの\n\
はねのぼうしを かぶると,\n\
3かいジャンプで\n\
そらたかく とびあがれる。\n\
そうさはスティックで!\n\
てまえにひくと あがる。\n\
まえにたおすと さがる。\n\
やめるときはZボタンで!"))

DEFINE_DIALOG(DIALOG_065, 1, 5, 30, 200, _("\
およぎかた おしえます。\n\
\n\
みずにはいるとおよげます。\n\
ながいあいだ『もぐる』と\n\
くるしくなります。\n\
すすむためには Aボタン。\n\
タイミングよく おすと\n\
スピ-ドが でます。\n\
3Dスティックを まえに\n\
たおすと もぐります。\n\
すいめんに もどったり,\n\
みずから あがるときは\n\
てまえにひいて Aボタン。\n\
すいめんでジャンプだ!\n\
\n\
Aボタン おしっぱなしに\n\
していても,およげます。\n\
らくちんです。\n\
およいでいるあいだは\n\
ドアを あけられません。"))

DEFINE_DIALOG(DIALOG_066, 1, 5, 30, 200, _("\
マリオ!  クッパのはく\n\
ほのおに きをつけて!\n\
クッパを こらしめるには\n\
うしろにまわりBボタンで\n\
シッポをつかむのよ!\n\
なげとばす まえには\n\
3Dスティックで\n\
グリグリふりまわすの。\n\
はやく まわすほど\n\
とおくまで とぶわ!\n\
Cボタンで まわりを\n\
よ-くみて!\n\
なげとばした クッパは\n\
4すみの バクダンに\n\
ぶつけてやるの!\n\
ねらいを\n\
よ-くさだめて・・・\n\
\n\
もういちどBボタンよ!"))

DEFINE_DIALOG(DIALOG_067, 1, 4, 30, 200, _("\
ざんねんだったなマリオ!\n\
ここには ピ-チちゃんは\n\
いませんでした。\n\
    ガハハッ!!\n\
わがはいの うしろに\n\
まわりこんで シッポを\n\
つかめるものなら\n\
つかんでみるんだな。\n\
スティックでグリグリ\n\
まわして なげるなど\n\
できるわけが ない!!\n\
  ガハハッ!!"))

DEFINE_DIALOG(DIALOG_068, 1, 5, 30, 200, _("\
ここは しゃくねつの\n\
ファイアバブル ランド!\n\
からだに ひがついても\n\
おちないように あわてず\n\
そうさしよう。\n\
ほのおのいけに おちると\n\
はねあがる!  そうさは\n\
できるので,おちついて。\n\
あまりうごきまわらないで\n\
ガンバレ!"))

DEFINE_DIALOG(DIALOG_069, 1, 3, 30, 200, _("\
『え』のなかのカイブツの\n\
せかいには,せかいの\n\
はてがあります。\n\
みえないカベにあたったら\n\
きっと そこが\n\
『え』のせかいのはてです。\n\
そらを とんでいるときも\n\
そこから さきには\n\
すすめません。"))

DEFINE_DIALOG(DIALOG_070, 1, 5, 30, 200, _("\
かいぶつたちの すんでる\n\
『え』のなかのせかいから,\n\
おしろの いりぐちの\n\
メインホ-ルに\n\
いつでも もどれます。\n\
かならず きちんと\n\
たちどまってから!\n\
スタ-トボタンでポ-ズし,\n\
『コ-スからでる』を\n\
えらんでください。\n\
ひとつのせかいのスタ-は\n\
ぜんぶ とらなくても,\n\
つぎのせかいにすすめます。\n\
じょうずになったら,また\n\
もどってきてください。\n\
スタ-を1つ とるごとに\n\
つぎのスタ-のヒントが\n\
スタ-トがめんに でます。\n\
えらんだヒントいがいの\n\
スタ-をとってもOKです。"))

DEFINE_DIALOG(DIALOG_071, 1, 4, 30, 200, _("\
 -このさきキケン-\n\
  あやしいケムリに\n\
  ちゅうい!\n\
 いきができません!\n\
くるしくなったら\n\
たかいところへ!\n\
まる・・・・・ひなんじょ\n\
やじるし・・・でいりぐち"))

DEFINE_DIALOG(DIALOG_072, 1, 5, 30, 200, _("\
カゼつよし!  ぼうしは\n\
しっかり かぶりましょう。\n\
もし ぼうしをなくしても\n\
ここでなくした ぼうしは\n\
このやまで みつかります。"))

DEFINE_DIALOG(DIALOG_073, 1, 5, 95, 200, _("\
ただしい じゅんばんで\n\
はこを ひらくこと。\n\
こたえは だれにも\n\
おしえてやらない。\n\
   --せんちょう--"))

DEFINE_DIALOG(DIALOG_074, 1, 5, 30, 200, _("\
ガケのカドに とびつくと\n\
ぶらさがれます。\n\
おりるときはスティックを\n\
マリオのうしろへいれるか,\n\
Zボタンをおしてください。\n\
のぼるときはスティックを\n\
まえに たおしてください。\n\
ぶらさがって\n\
すぐに Aボタンをおすと\n\
すばやく のぼれます!"))

DEFINE_DIALOG(DIALOG_075, 1, 5, 30, 200, _("\
マリオ!!たいへんです。\n\
クッパがまた・・・・\n\
おしろの パワ-スタ-を\n\
ぬすんで カベのなかへ!\n\
わたしたちも・・・\n\
みんなカベのなかへ・・・\n\
すいこまれていくわ・・・\n\
『カベ』や『え』のなか\n\
から パワ-スタ-を\n\
とりもどして!\n\
クッパの ふさいだドアは\n\
パワ-スタ-の ちからで\n\
ひらくことが できるわ!\n\
このへやには ひみつの\n\
つうろがあるの。\n\
クッパにみつからなかった\n\
かくしつうろの ひとつよ。\n\
そこには おしろの\n\
かくれスタ-が あるわ!\n\
きっと やくにたつはずよ。"))

DEFINE_DIALOG(DIALOG_076, 1, 5, 30, 200, _("\
パワ-スタ-のおかげで\n\
おしろに,げんきが\n\
もどってきました。\n\
クッパなんか\n\
おいはらってください。\n\
おやくに たつなら\n\
おしろの はなしをします。\n\
『カガミのへや』では\n\
カガミにうつらないものを\n\
よくみてください。\n\
みずのまちへ いくときは,\n\
『え』にとびこむ たかさ\n\
によって,まちをすっかり\n\
みずびたしに できます。\n\
アッ,これ みつけました。"))

DEFINE_DIALOG(DIALOG_077, 1, 3, 150, 200, _("\
とびらを ひらくまえに\n\
2つの はしらを\n\
おしさげて おくこと。"))

DEFINE_DIALOG(DIALOG_078, 1, 5, 30, 200, _("\
あおコインのブロックを\n\
ジャンプちゅうにZボタン\n\
『ヒップドロップ』で\n\
      ぶっつぶすと\n\
あおコインがでてきます。\n\
あおコイン1まいで\n\
きいろコイン5まいぶん\n\
とてもラッキ-!\n\
でも じかんがたつと\n\
きえてしまう・・ザンネン"))

DEFINE_DIALOG(DIALOG_079, 1, 5, 30, 200, _("\
いててて!\n\
はなしてくれよ。\n\
ウッキッキ-!\n\
チョットからかった\n\
だけなのに!\n\
はなしてくれたら,\n\
いいもの あげるからさ。\n\
ネ-ネ- はなしてくれよ。\n\
\n\
   はなす  いやだ"))

DEFINE_DIALOG(DIALOG_080, 1, 3, 30, 200, _("\
ヘッヘッヘッ!"))

DEFINE_DIALOG(DIALOG_081, 1, 6, 30, 200, _("\
ここは みずにみちたまち。\n\
このまちは,あなたが\n\
ここを おとずれるときの\n\
たかさと,おなじだけの\n\
みずをもって\n\
あなたをむかえる。"))

DEFINE_DIALOG(DIALOG_082, 1, 5, 30, 200, _("\
ぼうしを なくすと\n\
ダメ-ジがおおくなるので\n\
だいじに してください。\n\
なくしたら,なくした\n\
コ-スで みつかります。\n\
アア-どうしよう・・・\n\
ピ-チひめは,カベに\n\
ひきこまれた ままだし。\n\
はやく クッパを\n\
やっつけてください。\n\
えのほかにカベのなかにも\n\
モンスタ-の せかいが\n\
あります。  あっ!これ\n\
もっていって ください。\n\
かくして もってました。"))

DEFINE_DIALOG(DIALOG_083, 1, 4, 30, 200, _("\
とけいがとても へんです。\n\
とけいに はいるとき,\n\
ながいはりの ばしょに\n\
ちゅういしてください!\n\
これ,とりもどしました。\n\
もっていって ください。\n\
かっこよく\n\
うけとってくださいね!"))

DEFINE_DIALOG(DIALOG_084, 1, 5, 30, 200, _("\
イテテ らんぼうなひとだ。\n\
このスタ-は クッパって\n\
ヤツが くれたんだよ。\n\
あんたのものだ なんて\n\
しらなかったよ。\n\
かえすって,かえすってば,\n\
かえせば いいんでしょ。\n\
はなしてくれたら\n\
スタ-ぐらい かえすから。\n\
ホイ!!"))

DEFINE_DIALOG(DIALOG_085, 1, 4, 30, 200, _("\
この やかたから\n\
  ぶじにでられたら\n\
\n\
・・・エライ。・・"))

DEFINE_DIALOG(DIALOG_086, 1, 3, 30, 200, _("\
まわりをクルクルまわると\n\
めをまわす ヤツがいます。"))

DEFINE_DIALOG(DIALOG_087, 1, 5, 30, 200, _("\
えんとつから はいるのは\n\
サンタだけではありません。\n\
  ごえんりょなく\n\
  おはいりください。\n\
スノ-マンハウスお-な-"))

DEFINE_DIALOG(DIALOG_088, 1, 5, 30, 200, _("\
-さぎょうリフトじょう-\n\
\n\
ここから おりるひとは\n\
ひだりのぼうにつかまって,\n\
きをつけて おりること。"))

DEFINE_DIALOG(DIALOG_089, 1, 4, 95, 200, _("\
どちらのみちも キケン!\n\
くらいあしもとにチュウイ。\n\
はばとび できないひとは\n\
みぎのみちを すすめ。\n\
みぎ・・さぎょうリフト\n\
    ケムリめいろ\n\
ひだり・・やみのおおあな\n\
     ちていこ ヘ\n\
あかまる\n\
 ・・2ごうエレベ-タ-\n\
      ちていこ へ\n\
やじるし・・げんざいち"))

DEFINE_DIALOG(DIALOG_090, 1, 6, 30, 200, _("\
ガハハッ!\n\
ワナにはまったなマリオ!\n\
また ジャマをしにきた\n\
ようだが,ともだちからの\n\
ちゅうこくだ。\n\
あしもとには きをつけな。"))

DEFINE_DIALOG(DIALOG_091, 1, 3, 30, 200, _("\
つよいカゼに チュウイ!\n\
でも,カゼにのると\n\
フワフワきもちいいです。"))

DEFINE_DIALOG(DIALOG_092, 1, 3, 30, 200, _("\
いいかげんにしろマリオ!\n\
いつもいつも,わがはいの\n\
ジャマをしおって!\n\
せっかく かいぶつたちと\n\
たのしくやっているのに。\n\
スタ-をかえすんだ!\n\
カベのなかのヤツらには,\n\
そいつが いるんだよ!!\n\
ガハハッ!!"))

DEFINE_DIALOG(DIALOG_093, 1, 4, 30, 200, _("\
アララ!いつのまにきた?\n\
・・・・・・ムム\n\
どちらにしろ わがはいの\n\
ほのおの えじきだっ!\n\
どれだけスタ-のちからを\n\
かりても,わがはいには\n\
かなうわけがないわ!\n\
ガハハッ!! マリオ!\n\
キサマの おともだちも\n\
み-んな カベのなかさ。\n\
ピ-チちゃんも わたさん\n\
もんね!  いくぞ!!"))

DEFINE_DIALOG(DIALOG_094, 1, 3, 30, 200, _("\
のぼりにくい さかみちは\n\
じょそうをつけて\n\
げんきよく のぼる!\n\
はばとび おぼえてるか?\n\
はしりながら Zボタンで\n\
しゃがんで ジャンプだ!"))

DEFINE_DIALOG(DIALOG_095, 1, 3, 30, 200, _("\
このように カンバンの\n\
まえで Bボタンをおすと\n\
よむことができます。\n\
ノコノコや どうぶつたち\n\
と はなすときは,まえに\n\
たちどまってください。\n\
このコ-スにあるクッパに\n\
ぬすまれたパワ-スタ-を\n\
とりかえしてください。"))

DEFINE_DIALOG(DIALOG_096, 1, 5, 30, 200, _("\
このあたり みちせまし。\n\
ゆっくり あるこう!\n\
だれも ちょうじょうまで\n\
たどりつかせない。\n\
フフフ。\n\
きもちよくねているひとを\n\
おこすと,とっても\n\
ふきげんに なります。\n\
ゆっくりと しずかに\n\
あるきましょう。フフフ。"))

DEFINE_DIALOG(DIALOG_097, 1, 4, 30, 200, _("\
たいあたり されたら\n\
たいあたりで かえせ!\n\
ほのおのうみにつきおとす\n\
1たい1のデスマッチだ!"))

DEFINE_DIALOG(DIALOG_098, 1, 3, 95, 200, _("\
ここまでおいで・・・・\n\
ケッケッケ・・"))

DEFINE_DIALOG(DIALOG_099, 1, 3, 95, 200, _("\
クックック・・\n\
 とりついてやる。\n\
    ヒッヒッヒ!\n\
カベも とおりぬけてやる。\n\
こんなこと できるか?\n\
     ケッケッケ!"))

DEFINE_DIALOG(DIALOG_100, 1, 4, 95, 200, _("\
ウッキッキ-\n\
 ワッキッキ-!\n\
   ホヨホヨ。\n\
いっただき-。"))

DEFINE_DIALOG(DIALOG_101, 1, 5, 95, 200, _("\
ヘッヘッヘッ!\n\
つかまっちゃいました。\n\
きにいってたのになあ・・\n\
かえしますよ。\n\
 ウッキッキ-!!"))

DEFINE_DIALOG(DIALOG_102, 1, 4, 30, 200, _("\
テレサの たおしかた\n\
おしえます。\n\
はずかしがりやの\n\
テレサです。\n\
『めとめがあう』と\n\
すがたをけします。\n\
『とうめいのとき』は\n\
あたりません。\n\
『せなかをむける』と\n\
あらわれます。\n\
うしろにまわって\n\
なぐると よわい。"))

DEFINE_DIALOG(DIALOG_103, 1, 4, 95, 200, _("\
4ほんの はしらのうえに\n\
たつものに,わたしは,\n\
このやかたを おとずれる\n\
しかくを あたえよう。"))

DEFINE_DIALOG(DIALOG_104, 1, 6, 30, 200, _("\
めのまえのブル-グレ-の\n\
はんとうめいの ほしは\n\
『パワ-スタ-のだい』だ。\n\
あかコインを みつけて\n\
8まいぜんぶ あつめると,\n\
スタ-が あらわれる。"))

DEFINE_DIALOG(DIALOG_105, 1, 3, 95, 200, _("\
じゅんび かんりょう!\n\
そこの あなに\n\
はいってみてください。\n\
4つのたいほうをつかって\n\
そらのしまにあるスタ-を\n\
とれるはずです。\n\
スティックでねらいをつけ,\n\
Aではっしゃ!とびながら\n\
『き』にも つかまれます。"))

DEFINE_DIALOG(DIALOG_106, 1, 3, 95, 200, _("\
じゅんびが\n\
かんりょう しました!\n\
それでは,おきをつけて!"))

DEFINE_DIALOG(DIALOG_107, 1, 3, 95, 200, _("\
おばけは し な な い\n\
ケッケッケ・・\n\
ぶじに でられるかな?"))

DEFINE_DIALOG(DIALOG_108, 1, 3, 95, 200, _("\
ぼよよ-ん\n\
おやかたの おでましだ。\n\
カッカッカ・・"))

DEFINE_DIALOG(DIALOG_109, 1, 4, 95, 200, _("\
カラダが とけちゃったヨ。\n\
いいカラダ いないかな-\n\
なにか おちつかなくてネ。\n\
ア- かおがつめたいな-"))

DEFINE_DIALOG(DIALOG_110, 1, 3, 95, 200, _("\
しょうらい きっと\n\
りっぱなカラダになろうと\n\
おもってま-す!\n\
いいアタマ いないかな-\n\
もししっていたら そこへ\n\
つれてってくれませんか?\n\
まえを すべってくれれば\n\
うしろをついていきま-す。\n\
 ヨロシク-!"))

DEFINE_DIALOG(DIALOG_111, 1, 3, 95, 200, _("\
ヤッリ-!\n\
きぶんスッキリ!りっぱな\n\
カラダが みつかった!\n\
おれいに これあげます!\n\
もっていって ください。\n\
とってもアッタカイですよ。"))

DEFINE_DIALOG(DIALOG_112, 1, 4, 30, 200, _("\
コインいっぱいあつめよう。\n\
ちからが かいふくする。\n\
えのなかの15コ-スでは\n\
きろくにも のこるよ。\n\
あかいハ-トにさわっても\n\
ちからが かいふくする。\n\
はやく かけぬけるほど\n\
たくさん かいふくする!"))

DEFINE_DIALOG(DIALOG_113, 1, 6, 30, 200, _("\
あか・あお・みどりの\n\
ブロックには アイテムの\n\
『ぼうし』が はいってる。\n\
おしろの どこかにある\n\
スイッチを ふんでくると\n\
つかえるように なります。"))

DEFINE_DIALOG(DIALOG_114, 1, 4, 95, 200, _("\
ああ~ きにいらねえ!\n\
おれたち,いしのおかげで\n\
『いえ』も『しろ』も\n\
できてるって-のに。\n\
いつも ふみつけるばっか\n\
りで, ちった-ありがた\n\
がったら どうなんでぃ!\n\
おうおうっ!\n\
おい! そこのニイサン!\n\
ふらふらしてんじゃね-や。\n\
きげんが わるいんでぃ!\n\
おしつぶしちまうぞぉ!!\n\
もんくが あんなら\n\
ヒップドロップで この\n\
バッタンキングさまを\n\
ふみつけて みやがれっ!"))

DEFINE_DIALOG(DIALOG_115, 1, 5, 95, 200, _("\
ああ くやしいぞ!\n\
またまた\n\
ふみつけられちまった!\n\
しょせん いしは\n\
    いしなのか・・・\n\
おめぇの かちでぇ!\n\
これ もっていきやがれ!\n\
ガクッ!"))

DEFINE_DIALOG(DIALOG_116, 1, 5, 95, 200, _("\
おおっ!いてて! まわり\n\
こみのはやさは まだまだ\n\
だが,なかなか つよいな。\n\
おまえのような けらいが\n\
ほしかったぞ・・\n\
はじめの やくそくどおり\n\
パワ-スタ-をやろう。\n\
また ワシにあいたいとき\n\
このスタ-をメニュ-から\n\
えらぶがよい。さらばじゃ"))

DEFINE_DIALOG(DIALOG_117, 1, 3, 95, 200, _("\
ジャジャジャ-ン!\n\
どうだ!\n\
おどろいたか??・・・\n\
ムム・・・・ ならば\n\
もっとオドロカセテやる!\n\
イクゾ! カカッテコイ!"))

DEFINE_DIALOG(DIALOG_118, 1, 5, 95, 200, _("\
オオオッ・・・\n\
オマエ,いがいとツヨイ!\n\
このヤカタは,きょうから\n\
オマエのものダッ・・\n\
ジユウニつかエ。ガクッ!"))

DEFINE_DIALOG(DIALOG_119, 1, 4, 30, 200, _("\
グウウッ!  ちょっと\n\
ゆだん しておったわ!\n\
せっかくのケイカクが\n\
ぶちこわしだ・・・しかし\n\
パワ-スタ-もピ-チも\n\
わがはいの てのなかに\n\
あるのだ。ガハハハ!\n\
まだまだ まけてはおらん。\n\
これいじょうスタ-は\n\
わたさんぞ。きょうはここ\n\
らで かんべんしてやる!\n\
おおぉ,おぼえてろよ!!"))

DEFINE_DIALOG(DIALOG_120, 1, 4, 30, 200, _("\
グググッワッ!\n\
こうも かんたんに\n\
やられるとは,スタ-の\n\
ちからが たりんのかな?\n\
わがはいがゼッコ-チョ-\n\
のときなら,キサマなんか\n\
てきではない。\n\
こんかいは ひきわけだっ\n\
ピ-チに あいたければ,\n\
とうのてっぺんまで\n\
のぼってきてみろ。\n\
まってるぞ!ガハハッ!!"))

DEFINE_DIALOG(DIALOG_121, 1, 5, 30, 200, _("\
あああっ・・またこんども\n\
キサマのかちか マリオ!\n\
キサマはな,わがはいが\n\
せかいで い-ちばん\n\
まけたくないヤツなのに!\n\
せっかく なかまにした\n\
モンスタ-たちのちからも\n\
なくなり このままでは\n\
またまた,わがはいの\n\
だ-いきらいな\n\
へいわが もどってしまう\n\
ではないか! \n\
ムムムッ・・・・\n\
しかし,このゲ-ムは\n\
まだまだ おわらんぞ。\n\
みんなで あつまって,\n\
なかよくエンディングでも\n\
みるんだな!\n\
\n\
ガハハハッ!"))

DEFINE_DIALOG(DIALOG_122, 1, 6, 30, 200, _("\
-やみにとけるおおあな-\n\
\n\
みぎ・・・さぎょうリフト\n\
     ケムリめいろ\n\
ひだり・・ちていこ"))

DEFINE_DIALOG(DIALOG_123, 1, 5, 30, 200, _("\
 -メタルのどうくつ-\n\
\n\
みぎ・・・ちじょうへ\n\
ひだり・・メタルスイッチ"))

DEFINE_DIALOG(DIALOG_124, 1, 5, 30, 200, _("\
-さぎょうようリフト-\n\
\n\
   キケン!!\n\
 そうさほうほうを\n\
 よく よむこと。\n\
ふんだ,やじるしのほうに\n\
すすみつづけます。\n\
\n\
おりると もとのばしょに\n\
もどります。"))

DEFINE_DIALOG(DIALOG_125, 1, 5, 30, 200, _("\
-ケムリめいろ・でぐち-\n\
\n\
キケン! ヘイサちゅう。\n\
ここからは はいれません。"))

DEFINE_DIALOG(DIALOG_126, 1, 6, 30, 200, _("\
・1ごうエレベ-タ-・\n\
\n\
うえ・・やみのおおあな\n\
みぎ・・さぎょうリフト\n\
    ケムリめいろ"))

DEFINE_DIALOG(DIALOG_127, 1, 5, 30, 200, _("\
  -ちていこ-\n\
\n\
みぎ・・メタルのどうくつ\n\
ひだり・・はいこう\n\
     へいさちゅう\n\
おとなしい かいりゅう\n\
ドッシ-が すんでます\n\
せなかでヒップドロップを\n\
すると,あたまをさげます。\n\
エサにならないでください。"))

DEFINE_DIALOG(DIALOG_128, 1, 4, 95, 200, _("\
おっとっと!じょうがいに\n\
なげるのは はんそくだ!\n\
リングのうえでフェア-に\n\
たたかおうでは ないか!"))

DEFINE_DIALOG(DIALOG_129, 1, 5, 30, 200, _("\
とうめいスイッチの\n\
  コ-スへ ようこそ!\n\
あおいスイッチを ふむと\n\
すべての あおブロックが\n\
『じったい』になる。\n\
とうめいぼうしで\n\
とうめいに なると\n\
いろんな ものを\n\
とおりぬけられます。\n\
まずは おためしください。"))

DEFINE_DIALOG(DIALOG_130, 1, 5, 30, 200, _("\
メタルのスイッチの\n\
  コ-スヘ ようこそ!\n\
みどりのスイッチを\n\
ふめば みどりブロックが\n\
『じったい』になる。\n\
メタルのぼうしで\n\
メタルになれば,\n\
みずのなかでも\n\
あるけてしまう。\n\
まずは おためしください。"))

DEFINE_DIALOG(DIALOG_131, 1, 5, 30, 200, _("\
はねのスイッチの\n\
  コ-スヘ ようこそ!\n\
にじのリングのまんなかの\n\
とうの うえにある\n\
あかいスイッチを ふもう。\n\
このせかいの すべての\n\
あかいブロックが\n\
『じったい』になる。\n\
3だんとびで そらへとび,\n\
Zボタンで ランディング。\n\
そうさは ひこうきの\n\
そうじゅうかん のように\n\
まえにたおすと『さがる』\n\
てまえにひくと『あがる』\n\
まずは おためしを!"))

DEFINE_DIALOG(DIALOG_132, 1, 5, 30, 200, _("\
ダメダメ!\n\
それは きていいはんです。\n\
『しっか-く!』\n\
こんどはフェア-に\n\
いきましょう。"))

DEFINE_DIALOG(DIALOG_133, 1, 5, 30, 200, _("\
ああよかった。\n\
きてくれたんですね!\n\
ピ-チひめも ぼくたちも\n\
みんな『カベ』のなかに\n\
とじこめられちゃいました。\n\
クッパは パワ-スタ-を\n\
つかって『カベ』や『え』\n\
のなかにカイブツのくにを\n\
つくろうと しています。\n\
スタ-をとりかえして!\n\
『スタ-』をいくつか\n\
とりかえしたら,クッパの\n\
とじたドアが ひらきます。\n\
1かいの 4つのへやを\n\
さがし,すすんでください。\n\
まずは,ヒダリがわの\n\
ボムへいの『え』の\n\
へやに はいれます。\n\
このへやだけは クッパの\n\
ふういんを のがれました。\n\
8まい たまったら\n\
おおきな ほしのドアを\n\
ひらくことが できます。\n\
きっと ピ-チひめは\n\
そのなかです!"))

DEFINE_DIALOG(DIALOG_134, 1, 4, 30, 200, _("\
コ-スのはじめにえらべる\n\
スタ-のなまえは,\n\
つぎに みつけられそうな\n\
スタ-のヒントです。\n\
ヒントにでてくる\n\
じゅんばんと,ちがう\n\
スタ-を とりもどしても\n\
かまわないですよ。\n\
『スタ-』や『てき』や\n\
『アイテム』のなかには\n\
そのスタ-をえらばないと\n\
でないものも あります。\n\
いくつか とりかえしたら\n\
つぎのコ-スのドアへと\n\
すすんでください。みんな\n\
たすけを まっています!"))

DEFINE_DIALOG(DIALOG_135, 1, 5, 30, 200, _("\
クッパがスタ-をもって\n\
いっちゃいました。\n\
ここにかくれてみてました。\n\
スタ-はひとつのコ-スに\n\
6こあるはずです。\n\
でも アイテムスイッチを\n\
ぜんぶおしてからでないと\n\
とれないスタ-もあります。\n\
どんどん さきのコ-スへ\n\
すすんでください。\n\
スタ-トがめんでスタ-の\n\
なまえが みられます。\n\
むかしのてきに あいたい\n\
とき,そのほしをえらぶと\n\
またあえる てきもいます。"))

DEFINE_DIALOG(DIALOG_136, 1, 4, 30, 200, _("\
ワァすごい!もうそんなに\n\
スタ-をもってるんですね。\n\
もうすぐ ぼくらのことも\n\
たすけだしてくれますね!\n\
クッパたちは ひっしです。\n\
きをつけてください。\n\
コインをとると ちからが\n\
かいふくします。\n\
あかコインは2まいぶん。\n\
あおコインは5まいぶん。\n\
あおコインのブロックを\n\
こわすと でてきます。\n\
たかいところからおちても\n\
ちじょうの ちかくで\n\
『ヒップドロップ』すると\n\
ダメ-ジを ふせげます。"))

DEFINE_DIALOG(DIALOG_137, 1, 5, 30, 200, _("\
パワ-スタ-が もどって,\n\
おしろのちからが\n\
かいふく してきました!\n\
ありがとう。 クッパは\n\
このさきに にげました。\n\
そうだ!コインをあつめて\n\
ますか?15のコ-スでは\n\
コイン100まい とると\n\
スペシャルスタ-が\n\
あらわれます。"))

DEFINE_DIALOG(DIALOG_138, 1, 5, 30, 200, _("\
・2ごうエレベ-タ-・\n\
した・・ちていこ\n\
ひだり・・やみのおおあな\n\
みぎ・・・ケムリめいろ\n\
     へいさちゅう!"))

DEFINE_DIALOG(DIALOG_139, 1, 6, 30, 200, _("\
このうえ・・じどうリフト\n\
じどうリフトは のると\n\
じどうてきに うごきだし,\n\
コ-スにそってすすみます。\n\
おりて ほうっておくと\n\
きえてしまいます。"))

DEFINE_DIALOG(DIALOG_140, 1, 6, 30, 200, _("\
-そうさリフトじょう-\n\
みぎ・・・ケムリめいろ\n\
     いりぐち\n\
ひだり・・やみのおおあな\n\
  1ごうエレベ-タ-へ\n\
やじるし・・げんざいち"))

DEFINE_DIALOG(DIALOG_141, 1, 5, 150, 200, _("\
ぬすまれたパワ-スタ-を\n\
とりかえした!\n\
クッパが とじてしまった\n\
ドアを あけられるように\n\
なったぞ!\n\
2かいの ピ-チのへや,\n\
1かいの とりでのへや,\n\
2つのへやのドアがひらく。\n\
つぎのスタ-をとりかえし\n\
おしろのみんなをすくえ!\n\
モンスタ-たちはどんどん\n\
ちからを つけてきている。\n\
いそげ マリオ!!\n\
おしろの いちだいじだ!"))

DEFINE_DIALOG(DIALOG_142, 1, 5, 150, 200, _("\
3このスタ-を\n\
とりもどしたぞ! \n\
そして スタ-に『3』の\n\
すうじが ついたドアを\n\
ひらけるように なった!\n\
4つのへやの せかいを\n\
じゆうに いききできる。\n\
あたらしいカイブツたちは\n\
もっと てごわいぞ。\n\
きをつけて すすめ!"))

DEFINE_DIALOG(DIALOG_143, 1, 6, 150, 200, _("\
8このパワ-スタ-を\n\
ぶじ とりもどし,\n\
おおきな ほしのドアが\n\
ひらくようになった。\n\
クッパは すぐそこだ!\n\
ピ-チのこえがきこえる。"))

DEFINE_DIALOG(DIALOG_144, 1, 5, 150, 200, _("\
30この パワ-スタ-を\n\
とりもどし,\n\
おおきなスタ-のドアが\n\
ひらくようになった!\n\
ここですこし てんけんだ。\n\
2ほんのはしらを ヒップ\n\
ドロップしてみたか?\n\
ぼうしはなくしてないか?\n\
さばくで なくしたなら\n\
ハゲたかジャンゴをさがせ。\n\
クッパは うみから\n\
このちかにせんにゅう\n\
したらしい。\n\
とうとうやつを\n\
おいつめたぞ!"))

DEFINE_DIALOG(DIALOG_145, 1, 4, 150, 200, _("\
50このパワ-スタ-を\n\
とりもどした!\n\
3かいへの ほしのドアが\n\
ひらくぞ!\n\
クッパはすぐそこだ!\n\
アイテムスイッチは\n\
ぜんぶおしてきたか?\n\
かくにん しておこう。\n\
あか・あお・みどりの\n\
3つのアイテムブロックは\n\
とてもだいじな みかただ。\n\
さあ『3かい』へすすめ!"))

DEFINE_DIALOG(DIALOG_146, 1, 6, 150, 200, _("\
70このパワ-スタ-を\n\
とりもどした!\n\
はてしない かいだんの\n\
ナゾがとかれた。\n\
クッパはかなりあせってる。\n\
さあ!さいごのたたかいだ。"))

DEFINE_DIALOG(DIALOG_147, 1, 5, 30, 200, _("\
あか・あお・みどりの\n\
『アイテムブロック』を\n\
つかっていますか?\n\
スタ-をとりもどすと\n\
いりぐちがみつかる,\n\
おしろのかくしコ-スで,\n\
3つのスイッチを おすと\n\
そのいろのブロックが\n\
『じったい』となり,\n\
つかえるようになります。\n\
あかは はねのぼうし\n\
みどりは メタルのぼうし\n\
あおは とうめいのぼうし\n\
\n\
とてもつよい みかたです。"))

DEFINE_DIALOG(DIALOG_148, 1, 5, 30, 200, _("\
このさきスノ-マンのやま\n\
だれも はいるな!\n\
アイスブロックシュ-タ-\n\
を 3だんとびなどして\n\
とびこえては イケマセン。\n\
つめたい いけでは\n\
はやく たいりょくが\n\
へります!\n\
かいふくも しません。\n\
      スノ-マン"))

DEFINE_DIALOG(DIALOG_149, 1, 5, 30, 200, _("\
ピ-チのかくれスライダ-\n\
へ ようこそ!\n\
ここには クッパにみつけ\n\
られなかった おしろの\n\
かくれスタ-がのこってる。\n\
さかを すべりはじめたら\n\
スティックまえで かそく,\n\
うしろで げんそくできる。\n\
はやくすべれば スタ-が\n\
みつかるはずだ!"))

DEFINE_DIALOG(DIALOG_150, 1, 5, 30, 200, _("\
あ--ん,だれだい?\n\
とつぜん ビショぬれに\n\
なっちゃいました!\n\
キチンと てんじょう\n\
なおしてもらうです。"))

DEFINE_DIALOG(DIALOG_151, 1, 4, 30, 200, _("\
みずをかけられた つぎは\n\
ふんづけられました。\n\
もう ほんと-に\n\
おこったです!"))

DEFINE_DIALOG(DIALOG_152, 1, 5, 30, 200, _("\
いててて!!!\n\
らんぼうなひとだなあ。\n\
なぜかイライラしてたけど,\n\
まあ,そらがみえるのも\n\
わるくはないです。\n\
よるには いっぱいほしが\n\
みえるしね!\n\
このほしは かえします。\n\
あ-,なんだか きもちが\n\
おちついてきたです。"))

DEFINE_DIALOG(DIALOG_153, 1, 4, 30, 200, _("\
わしの カラダに\n\
のぼっては いか-ん!\n\
そういうヤツは みんな\n\
ふきっとばしちまうぞ-!"))

DEFINE_DIALOG(DIALOG_154, 1, 5, 30, 200, _("\
ぼうしを なくすと\n\
ダメ-ジがおおくなるので\n\
だいじに してください。\n\
なくしたら,なくした\n\
コ-スで みつかります。\n\
アア-どうしよう・・・\n\
ピ-チひめは,カベに\n\
ひきこまれたままだし。\n\
はやく クッパを\n\
やっつけてください。\n\
ああ,そうだ!\n\
えのほかにカベのなかにも\n\
モンスタ-の せかいが\n\
あります。\n\
よ-く,しらべてください。"))

DEFINE_DIALOG(DIALOG_155, 1, 5, 30, 200, _("\
パワ-スタ-のおかげで\n\
おしろに,げんきが\n\
もどってきました。\n\
クッパなんか\n\
おいはらってください。\n\
おやくに たつなら\n\
おしろの はなしをします。\n\
『カガミのへや』では\n\
カガミにうつらないものを\n\
よくみてください。\n\
みずのまちへ いくときは,\n\
『え』にとびこむ たかさ\n\
によって,まちをすっかり\n\
みずびたしに できます。"))

DEFINE_DIALOG(DIALOG_156, 1, 4, 30, 200, _("\
とけいがとても へんです。\n\
とけいに はいるとき,\n\
ながいはりの ばしょに\n\
ちゅういしてください!"))

DEFINE_DIALOG(DIALOG_157, 1, 5, 30, 200, _("\
ながれる『すな』に\n\
ながされないように\n\
きをつけて!\n\
からだが しずんで\n\
ジャンプできません。\n\
あたままでしずむと\n\
いきが できません。\n\
くらいいろの ところは\n\
とくに キケン!!\n\
そこなしの じごくです!"))

DEFINE_DIALOG(DIALOG_158, 1, 5, 30, 200, _("\
ジャンプのテクニック\n\
その1\n\
タイミングよく,\n\
れんぞくでジャンプすると\n\
だんだん たかくとべる。\n\
スピ-ドがはやいほど\n\
たかく とびあがれる。\n\
れんぞく3かいめに\n\
たかくとべるわざを\n\
『3だんとび』といいます。\n\
その2  カベにむかって\n\
ジャンプして,そこから\n\
もういちどジャンプできる。\n\
『カベキック』といって,\n\
たかいところにのぼれます。"))

DEFINE_DIALOG(DIALOG_159, 1, 5, 30, 200, _("\
ジャンプのテクニック\n\
その3  Zボタンわざ\n\
たちどまって しゃがんで\n\
から ジャンプすると,\n\
『バックちゅう』できます。\n\
はやくはしりながら\n\
しゃがんでジャンプすると\n\
とおくまで とべる。\n\
『はばとび』です。"))

DEFINE_DIALOG(DIALOG_160, 1, 4, 30, 200, _("\
はやく はしりながら\n\
Bボタンをおすと\n\
『ボディアタック』が\n\
できます。\n\
おなかで\n\
すべっているあいだは,\n\
A・Bどちらのボタンでも\n\
おきあがることができます。"))

DEFINE_DIALOG(DIALOG_161, 1, 5, 30, 200, _("\
いや- すごいです!!\n\
ここにいれば あえると\n\
きいてたけど,ほんとに\n\
あえてしまいました!!\n\
でんごんが あります。\n\
『これで,おしまいですが\n\
もっとあそんでほしいので\n\
つまらないものですが\n\
うけとって ください。』\n\
-マリオ・スタッフより-"))

DEFINE_DIALOG(DIALOG_162, 1, 5, 30, 200, _("\
イテテ あいかわらず\n\
らんぼうなひとだな。\n\
このスタ-は べつに\n\
かくしてたわけじゃ\n\
ないんだってば!\n\
かえせば いいんでしょ。\n\
はなしてくれたら\n\
スタ-ぐらい かえすから。\n\
これで ほんとに\n\
さいごだよ!  ホイ!"))

DEFINE_DIALOG(DIALOG_163, 1, 5, 30, 200, _("\
あああっ・・またこんども\n\
キサマのかちか マリオ!\n\
キサマはな,わがはいが\n\
せかいで い-ちばん\n\
まけたくないヤツなのに!\n\
ほんとうに やくにたたぬ\n\
カイブツどもだ!\n\
キサマごときに\n\
パワ-スタ-をぜ-んぶ\n\
とりもどされるとは・・・\n\
ぜんぶで『120こ』も\n\
あったのか!?\n\
『しろ』に わがはいも\n\
きづかなかったスタ-が\n\
のこって おったとは・・\n\
またまた わがはいの\n\
だ-いきらいな へいわが,\n\
もどってしまうではないか。\n\
わがはいは くやし-ぞ!\n\
きょうは ひきあげてやる。\n\
だが,こんどあうときは\n\
ぜ-ったい まけないぞ!\n\
3Dスティックをみがいて\n\
まってろよ!\n\
 ガハハッ!"))

DEFINE_DIALOG(DIALOG_164, 1, 4, 30, 200, _("\
しばらく やすんでたので\n\
こんなにみごとに,\n\
ふとっちゃいました。\n\
ひさしぶりに やります?\n\
では! いつものように,\n\
レディ-!\n\
\n\
   ゴ-!! やめとく"))

DEFINE_DIALOG(DIALOG_165, 1, 4, 30, 200, _("\
このクイの まわりを\n\
クルクルまわって\n\
めをまわしても\n\
しりません。"))

DEFINE_DIALOG(DIALOG_166, 1, 6, 30, 200, _("\
きょうは トレ-ニングで\n\
るすに してるッス!\n\
オイラに ちょ-せん\n\
したいひとは,またこんど\n\
くるといいッス!\n\
       ノコノコ"))

DEFINE_DIALOG(DIALOG_167, 1, 4, 30, 200, _("\
『ピ-チの おしろ』\n\
     すぐそこ\n\
Aボタン『ジャンプ』\n\
Zボタン『しゃがむ』\n\
Bボタン『カンバンよむ』\n\
    『パンチ』\n\
    『ものをもつ』\n\
もういちどおす『なげる』"))

DEFINE_DIALOG(DIALOG_168, 1, 4, 30, 200, _("\
ア-ン,またまた \n\
ふんづけられちゃいました。\n\
ハナチャン かんぜんに\n\
おこったです!"))

DEFINE_DIALOG(DIALOG_169, 1, 5, 30, 200, _("\
かってに はいるな!\n\
この『どうくつ』に\n\
むだんで はいるものには,\n\
わざわいが おとずれる!\n\
  --せんちょうより"))
